GopalSaraf/Practicals/PSDL/include/proc/pic18f56q71.h
// Register: DMA2PR
#define DMA2PR DMA2PR
extern volatile unsigned char           DMA2PR              __at(0x0B7);
#ifndef _LIB_BUILD
asm("DMA2PR equ 0B7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PR                     :3;
    };
    struct {
        unsigned PR0                    :1;
        unsigned PR1                    :1;
        unsigned PR2                    :1;
    };
    struct {
        unsigned DMA2PR                 :3;
    };
    struct {
        unsigned DMA2PR0                :1;
        unsigned DMA2PR1                :1;
        unsigned DMA2PR2                :1;
    };
} DMA2PRbits_t;
extern volatile DMA2PRbits_t DMA2PRbits __at(0x0B7);
// bitfield macros
#define _DMA2PR_PR_POSN                                     0x0
#define _DMA2PR_PR_POSITION                                 0x0
#define _DMA2PR_PR_SIZE                                     0x3
#define _DMA2PR_PR_LENGTH                                   0x3
#define _DMA2PR_PR_MASK                                     0x7
#define _DMA2PR_PR0_POSN                                    0x0
#define _DMA2PR_PR0_POSITION                                0x0
#define _DMA2PR_PR0_SIZE                                    0x1
#define _DMA2PR_PR0_LENGTH                                  0x1
#define _DMA2PR_PR0_MASK                                    0x1
#define _DMA2PR_PR1_POSN                                    0x1
#define _DMA2PR_PR1_POSITION                                0x1
#define _DMA2PR_PR1_SIZE                                    0x1
#define _DMA2PR_PR1_LENGTH                                  0x1
#define _DMA2PR_PR1_MASK                                    0x2
#define _DMA2PR_PR2_POSN                                    0x2
#define _DMA2PR_PR2_POSITION                                0x2
#define _DMA2PR_PR2_SIZE                                    0x1
#define _DMA2PR_PR2_LENGTH                                  0x1
#define _DMA2PR_PR2_MASK                                    0x4
#define _DMA2PR_DMA2PR_POSN                                 0x0
#define _DMA2PR_DMA2PR_POSITION                             0x0
#define _DMA2PR_DMA2PR_SIZE                                 0x3
#define _DMA2PR_DMA2PR_LENGTH                               0x3
#define _DMA2PR_DMA2PR_MASK                                 0x7
#define _DMA2PR_DMA2PR0_POSN                                0x0
#define _DMA2PR_DMA2PR0_POSITION                            0x0
#define _DMA2PR_DMA2PR0_SIZE                                0x1
#define _DMA2PR_DMA2PR0_LENGTH                              0x1
#define _DMA2PR_DMA2PR0_MASK                                0x1
#define _DMA2PR_DMA2PR1_POSN                                0x1
#define _DMA2PR_DMA2PR1_POSITION                            0x1
#define _DMA2PR_DMA2PR1_SIZE                                0x1
#define _DMA2PR_DMA2PR1_LENGTH                              0x1
#define _DMA2PR_DMA2PR1_MASK                                0x2
#define _DMA2PR_DMA2PR2_POSN                                0x2
#define _DMA2PR_DMA2PR2_POSITION                            0x2
#define _DMA2PR_DMA2PR2_SIZE                                0x1
#define _DMA2PR_DMA2PR2_LENGTH                              0x1
#define _DMA2PR_DMA2PR2_MASK                                0x4

// Register: DMA3PR
#define DMA3PR DMA3PR
extern volatile unsigned char           DMA3PR              __at(0x0B8);
#ifndef _LIB_BUILD
asm("DMA3PR equ 0B8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PR                     :3;
    };
    struct {
        unsigned PR0                    :1;
        unsigned PR1                    :1;
        unsigned PR2                    :1;
    };
    struct {
        unsigned DMA3PR                 :3;
    };
    struct {
        unsigned DMA3PR0                :1;
        unsigned DMA3PR1                :1;
        unsigned DMA3PR2                :1;
    };
} DMA3PRbits_t;
extern volatile DMA3PRbits_t DMA3PRbits __at(0x0B8);
// bitfield macros
#define _DMA3PR_PR_POSN                                     0x0
#define _DMA3PR_PR_POSITION                                 0x0
#define _DMA3PR_PR_SIZE                                     0x3
#define _DMA3PR_PR_LENGTH                                   0x3
#define _DMA3PR_PR_MASK                                     0x7
#define _DMA3PR_PR0_POSN                                    0x0
#define _DMA3PR_PR0_POSITION                                0x0
#define _DMA3PR_PR0_SIZE                                    0x1
#define _DMA3PR_PR0_LENGTH                                  0x1
#define _DMA3PR_PR0_MASK                                    0x1
#define _DMA3PR_PR1_POSN                                    0x1
#define _DMA3PR_PR1_POSITION                                0x1
#define _DMA3PR_PR1_SIZE                                    0x1
#define _DMA3PR_PR1_LENGTH                                  0x1
#define _DMA3PR_PR1_MASK                                    0x2
#define _DMA3PR_PR2_POSN                                    0x2
#define _DMA3PR_PR2_POSITION                                0x2
#define _DMA3PR_PR2_SIZE                                    0x1
#define _DMA3PR_PR2_LENGTH                                  0x1
#define _DMA3PR_PR2_MASK                                    0x4
#define _DMA3PR_DMA3PR_POSN                                 0x0
#define _DMA3PR_DMA3PR_POSITION                             0x0
#define _DMA3PR_DMA3PR_SIZE                                 0x3
#define _DMA3PR_DMA3PR_LENGTH                               0x3
#define _DMA3PR_DMA3PR_MASK                                 0x7
#define _DMA3PR_DMA3PR0_POSN                                0x0
#define _DMA3PR_DMA3PR0_POSITION                            0x0
#define _DMA3PR_DMA3PR0_SIZE                                0x1
#define _DMA3PR_DMA3PR0_LENGTH                              0x1
#define _DMA3PR_DMA3PR0_MASK                                0x1
#define _DMA3PR_DMA3PR1_POSN                                0x1
#define _DMA3PR_DMA3PR1_POSITION                            0x1
#define _DMA3PR_DMA3PR1_SIZE                                0x1
#define _DMA3PR_DMA3PR1_LENGTH                              0x1
#define _DMA3PR_DMA3PR1_MASK                                0x2
#define _DMA3PR_DMA3PR2_POSN                                0x2
#define _DMA3PR_DMA3PR2_POSITION                            0x2
#define _DMA3PR_DMA3PR2_SIZE                                0x1
#define _DMA3PR_DMA3PR2_LENGTH                              0x1
#define _DMA3PR_DMA3PR2_MASK                                0x4

// Register: DMA4PR
#define DMA4PR DMA4PR
extern volatile unsigned char           DMA4PR              __at(0x0B9);
#ifndef _LIB_BUILD
asm("DMA4PR equ 0B9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PR                     :3;
    };
    struct {
        unsigned PR0                    :1;
        unsigned PR1                    :1;
        unsigned PR2                    :1;
    };
    struct {
        unsigned DMA4PR                 :3;
    };
    struct {
        unsigned DMA4PR0                :1;
        unsigned DMA4PR1                :1;
        unsigned DMA4PR2                :1;
    };
} DMA4PRbits_t;
