GopalSaraf/Practicals/PSDL/include/proc/pic18f56q71.h
// Register: OPA1CON2
#define OPA1CON2 OPA1CON2
extern volatile unsigned char           OPA1CON2            __at(0x121);
#ifndef _LIB_BUILD
asm("OPA1CON2 equ 0121h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PCH                    :3;
        unsigned                        :1;
        unsigned NCH                    :3;
    };
    struct {
        unsigned PCH0                   :1;
        unsigned PCH1                   :1;
        unsigned PCH2                   :1;
        unsigned                        :1;
        unsigned NCH0                   :1;
        unsigned NCH1                   :1;
        unsigned NCH2                   :1;
    };
    struct {
        unsigned OPA1PCH                :3;
        unsigned                        :1;
        unsigned OPA1NCH                :3;
    };
    struct {
        unsigned OPA1PCH0               :1;
        unsigned OPA1PCH1               :1;
        unsigned OPA1PCH2               :1;
        unsigned                        :1;
        unsigned OPA1NCH0               :1;
        unsigned OPA1NCH1               :1;
        unsigned OPA1NCH2               :1;
    };
} OPA1CON2bits_t;
extern volatile OPA1CON2bits_t OPA1CON2bits __at(0x121);
// bitfield macros
#define _OPA1CON2_PCH_POSN                                  0x0
#define _OPA1CON2_PCH_POSITION                              0x0
#define _OPA1CON2_PCH_SIZE                                  0x3
#define _OPA1CON2_PCH_LENGTH                                0x3
#define _OPA1CON2_PCH_MASK                                  0x7
#define _OPA1CON2_NCH_POSN                                  0x4
#define _OPA1CON2_NCH_POSITION                              0x4
#define _OPA1CON2_NCH_SIZE                                  0x3
#define _OPA1CON2_NCH_LENGTH                                0x3
#define _OPA1CON2_NCH_MASK                                  0x70
#define _OPA1CON2_PCH0_POSN                                 0x0
#define _OPA1CON2_PCH0_POSITION                             0x0
#define _OPA1CON2_PCH0_SIZE                                 0x1
#define _OPA1CON2_PCH0_LENGTH                               0x1
#define _OPA1CON2_PCH0_MASK                                 0x1
#define _OPA1CON2_PCH1_POSN                                 0x1
#define _OPA1CON2_PCH1_POSITION                             0x1
#define _OPA1CON2_PCH1_SIZE                                 0x1
#define _OPA1CON2_PCH1_LENGTH                               0x1
#define _OPA1CON2_PCH1_MASK                                 0x2
#define _OPA1CON2_PCH2_POSN                                 0x2
#define _OPA1CON2_PCH2_POSITION                             0x2
#define _OPA1CON2_PCH2_SIZE                                 0x1
#define _OPA1CON2_PCH2_LENGTH                               0x1
#define _OPA1CON2_PCH2_MASK                                 0x4
#define _OPA1CON2_NCH0_POSN                                 0x4
#define _OPA1CON2_NCH0_POSITION                             0x4
#define _OPA1CON2_NCH0_SIZE                                 0x1
#define _OPA1CON2_NCH0_LENGTH                               0x1
#define _OPA1CON2_NCH0_MASK                                 0x10
#define _OPA1CON2_NCH1_POSN                                 0x5
#define _OPA1CON2_NCH1_POSITION                             0x5
#define _OPA1CON2_NCH1_SIZE                                 0x1
#define _OPA1CON2_NCH1_LENGTH                               0x1
#define _OPA1CON2_NCH1_MASK                                 0x20
#define _OPA1CON2_NCH2_POSN                                 0x6
#define _OPA1CON2_NCH2_POSITION                             0x6
#define _OPA1CON2_NCH2_SIZE                                 0x1
#define _OPA1CON2_NCH2_LENGTH                               0x1
#define _OPA1CON2_NCH2_MASK                                 0x40
#define _OPA1CON2_OPA1PCH_POSN                              0x0
#define _OPA1CON2_OPA1PCH_POSITION                          0x0
#define _OPA1CON2_OPA1PCH_SIZE                              0x3
#define _OPA1CON2_OPA1PCH_LENGTH                            0x3
#define _OPA1CON2_OPA1PCH_MASK                              0x7
#define _OPA1CON2_OPA1NCH_POSN                              0x4
#define _OPA1CON2_OPA1NCH_POSITION                          0x4
#define _OPA1CON2_OPA1NCH_SIZE                              0x3
#define _OPA1CON2_OPA1NCH_LENGTH                            0x3
#define _OPA1CON2_OPA1NCH_MASK                              0x70
#define _OPA1CON2_OPA1PCH0_POSN                             0x0
#define _OPA1CON2_OPA1PCH0_POSITION                         0x0
#define _OPA1CON2_OPA1PCH0_SIZE                             0x1
#define _OPA1CON2_OPA1PCH0_LENGTH                           0x1
#define _OPA1CON2_OPA1PCH0_MASK                             0x1
#define _OPA1CON2_OPA1PCH1_POSN                             0x1
#define _OPA1CON2_OPA1PCH1_POSITION                         0x1
#define _OPA1CON2_OPA1PCH1_SIZE                             0x1
#define _OPA1CON2_OPA1PCH1_LENGTH                           0x1
#define _OPA1CON2_OPA1PCH1_MASK                             0x2
#define _OPA1CON2_OPA1PCH2_POSN                             0x2
#define _OPA1CON2_OPA1PCH2_POSITION                         0x2
#define _OPA1CON2_OPA1PCH2_SIZE                             0x1
#define _OPA1CON2_OPA1PCH2_LENGTH                           0x1
#define _OPA1CON2_OPA1PCH2_MASK                             0x4
#define _OPA1CON2_OPA1NCH0_POSN                             0x4
#define _OPA1CON2_OPA1NCH0_POSITION                         0x4
#define _OPA1CON2_OPA1NCH0_SIZE                             0x1
#define _OPA1CON2_OPA1NCH0_LENGTH                           0x1
#define _OPA1CON2_OPA1NCH0_MASK                             0x10
#define _OPA1CON2_OPA1NCH1_POSN                             0x5
#define _OPA1CON2_OPA1NCH1_POSITION                         0x5
#define _OPA1CON2_OPA1NCH1_SIZE                             0x1
#define _OPA1CON2_OPA1NCH1_LENGTH                           0x1
#define _OPA1CON2_OPA1NCH1_MASK                             0x20
#define _OPA1CON2_OPA1NCH2_POSN                             0x6
#define _OPA1CON2_OPA1NCH2_POSITION                         0x6
#define _OPA1CON2_OPA1NCH2_SIZE                             0x1
#define _OPA1CON2_OPA1NCH2_LENGTH                           0x1
#define _OPA1CON2_OPA1NCH2_MASK                             0x40

// Register: OPA1CON3
#define OPA1CON3 OPA1CON3
extern volatile unsigned char           OPA1CON3            __at(0x122);
#ifndef _LIB_BUILD
asm("OPA1CON3 equ 0122h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PSS                    :5;
        unsigned INTOE                  :1;
        unsigned FMS                    :2;
    };
    struct {
        unsigned PSS0                   :1;
        unsigned PSS1                   :1;
        unsigned PSS2                   :1;
        unsigned PSS3                   :1;
        unsigned PSS4                   :1;
        unsigned                        :1;
        unsigned FMS0                   :1;
        unsigned FMS1                   :1;
    };
    struct {
        unsigned OPA1PSS                :5;
        unsigned OPA1INTOE              :1;
        unsigned OPA1FMS                :2;
    };
    struct {
        unsigned OPA1PSS0               :1;
        unsigned OPA1PSS1               :1;
        unsigned OPA1PSS2               :1;
        unsigned OPA1PSS3               :1;
        unsigned OPA1PSS4               :1;
        unsigned                        :1;
        unsigned OPA1FMS0               :1;
        unsigned OPA1FMS1               :1;
    };
} OPA1CON3bits_t;
extern volatile OPA1CON3bits_t OPA1CON3bits __at(0x122);
// bitfield macros
#define _OPA1CON3_PSS_POSN                                  0x0
#define _OPA1CON3_PSS_POSITION                              0x0
#define _OPA1CON3_PSS_SIZE                                  0x5
#define _OPA1CON3_PSS_LENGTH                                0x5
#define _OPA1CON3_PSS_MASK                                  0x1F
#define _OPA1CON3_INTOE_POSN                                0x5
#define _OPA1CON3_INTOE_POSITION                            0x5
#define _OPA1CON3_INTOE_SIZE                                0x1
#define _OPA1CON3_INTOE_LENGTH                              0x1
#define _OPA1CON3_INTOE_MASK                                0x20
#define _OPA1CON3_FMS_POSN                                  0x6
#define _OPA1CON3_FMS_POSITION                              0x6
#define _OPA1CON3_FMS_SIZE                                  0x2
#define _OPA1CON3_FMS_LENGTH                                0x2
#define _OPA1CON3_FMS_MASK                                  0xC0
#define _OPA1CON3_PSS0_POSN                                 0x0
#define _OPA1CON3_PSS0_POSITION                             0x0
#define _OPA1CON3_PSS0_SIZE                                 0x1
#define _OPA1CON3_PSS0_LENGTH                               0x1
#define _OPA1CON3_PSS0_MASK                                 0x1
#define _OPA1CON3_PSS1_POSN                                 0x1
#define _OPA1CON3_PSS1_POSITION                             0x1
#define _OPA1CON3_PSS1_SIZE                                 0x1
#define _OPA1CON3_PSS1_LENGTH                               0x1
#define _OPA1CON3_PSS1_MASK                                 0x2
#define _OPA1CON3_PSS2_POSN                                 0x2
#define _OPA1CON3_PSS2_POSITION                             0x2
#define _OPA1CON3_PSS2_SIZE                                 0x1
#define _OPA1CON3_PSS2_LENGTH                               0x1
#define _OPA1CON3_PSS2_MASK                                 0x4
#define _OPA1CON3_PSS3_POSN                                 0x3
#define _OPA1CON3_PSS3_POSITION                             0x3
#define _OPA1CON3_PSS3_SIZE                                 0x1
#define _OPA1CON3_PSS3_LENGTH                               0x1
#define _OPA1CON3_PSS3_MASK                                 0x8
#define _OPA1CON3_PSS4_POSN                                 0x4
#define _OPA1CON3_PSS4_POSITION                             0x4
#define _OPA1CON3_PSS4_SIZE                                 0x1
#define _OPA1CON3_PSS4_LENGTH                               0x1
#define _OPA1CON3_PSS4_MASK                                 0x10
#define _OPA1CON3_FMS0_POSN                                 0x6
#define _OPA1CON3_FMS0_POSITION                             0x6
#define _OPA1CON3_FMS0_SIZE                                 0x1
#define _OPA1CON3_FMS0_LENGTH                               0x1
#define _OPA1CON3_FMS0_MASK                                 0x40
#define _OPA1CON3_FMS1_POSN                                 0x7
#define _OPA1CON3_FMS1_POSITION                             0x7
#define _OPA1CON3_FMS1_SIZE                                 0x1
#define _OPA1CON3_FMS1_LENGTH                               0x1
#define _OPA1CON3_FMS1_MASK                                 0x80
#define _OPA1CON3_OPA1PSS_POSN                              0x0
#define _OPA1CON3_OPA1PSS_POSITION                          0x0
#define _OPA1CON3_OPA1PSS_SIZE                              0x5
#define _OPA1CON3_OPA1PSS_LENGTH                            0x5
#define _OPA1CON3_OPA1PSS_MASK                              0x1F
#define _OPA1CON3_OPA1INTOE_POSN                            0x5
#define _OPA1CON3_OPA1INTOE_POSITION                        0x5
#define _OPA1CON3_OPA1INTOE_SIZE                            0x1
#define _OPA1CON3_OPA1INTOE_LENGTH                          0x1
#define _OPA1CON3_OPA1INTOE_MASK                            0x20
#define _OPA1CON3_OPA1FMS_POSN                              0x6
#define _OPA1CON3_OPA1FMS_POSITION                          0x6
#define _OPA1CON3_OPA1FMS_SIZE                              0x2
#define _OPA1CON3_OPA1FMS_LENGTH                            0x2
#define _OPA1CON3_OPA1FMS_MASK                              0xC0
#define _OPA1CON3_OPA1PSS0_POSN                             0x0
#define _OPA1CON3_OPA1PSS0_POSITION                         0x0
#define _OPA1CON3_OPA1PSS0_SIZE                             0x1
#define _OPA1CON3_OPA1PSS0_LENGTH                           0x1
#define _OPA1CON3_OPA1PSS0_MASK                             0x1
#define _OPA1CON3_OPA1PSS1_POSN                             0x1
#define _OPA1CON3_OPA1PSS1_POSITION                         0x1
#define _OPA1CON3_OPA1PSS1_SIZE                             0x1
#define _OPA1CON3_OPA1PSS1_LENGTH                           0x1
#define _OPA1CON3_OPA1PSS1_MASK                             0x2
#define _OPA1CON3_OPA1PSS2_POSN                             0x2
#define _OPA1CON3_OPA1PSS2_POSITION                         0x2
#define _OPA1CON3_OPA1PSS2_SIZE                             0x1
#define _OPA1CON3_OPA1PSS2_LENGTH                           0x1
#define _OPA1CON3_OPA1PSS2_MASK                             0x4
#define _OPA1CON3_OPA1PSS3_POSN                             0x3
#define _OPA1CON3_OPA1PSS3_POSITION                         0x3
#define _OPA1CON3_OPA1PSS3_SIZE                             0x1
#define _OPA1CON3_OPA1PSS3_LENGTH                           0x1
#define _OPA1CON3_OPA1PSS3_MASK                             0x8
#define _OPA1CON3_OPA1PSS4_POSN                             0x4
#define _OPA1CON3_OPA1PSS4_POSITION                         0x4
#define _OPA1CON3_OPA1PSS4_SIZE                             0x1
#define _OPA1CON3_OPA1PSS4_LENGTH                           0x1
#define _OPA1CON3_OPA1PSS4_MASK                             0x10
#define _OPA1CON3_OPA1FMS0_POSN                             0x6
#define _OPA1CON3_OPA1FMS0_POSITION                         0x6
#define _OPA1CON3_OPA1FMS0_SIZE                             0x1
#define _OPA1CON3_OPA1FMS0_LENGTH                           0x1
#define _OPA1CON3_OPA1FMS0_MASK                             0x40
#define _OPA1CON3_OPA1FMS1_POSN                             0x7
#define _OPA1CON3_OPA1FMS1_POSITION                         0x7
#define _OPA1CON3_OPA1FMS1_SIZE                             0x1
#define _OPA1CON3_OPA1FMS1_LENGTH                           0x1
#define _OPA1CON3_OPA1FMS1_MASK                             0x80

// Register: OPA1CON4
#define OPA1CON4 OPA1CON4
extern volatile unsigned char           OPA1CON4            __at(0x123);
#ifndef _LIB_BUILD
asm("OPA1CON4 equ 0123h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned OFCSEL                 :2;
        unsigned OFCST                  :1;
        unsigned                        :1;
        unsigned PTRES                  :1;
    };
    struct {
        unsigned OFCSEL0                :1;
        unsigned OFCSEL1                :1;
    };
    struct {
        unsigned OPA1OFCSEL             :2;
        unsigned OPA1OFCST              :1;
        unsigned                        :1;
        unsigned OPA1PTRES              :1;
    };
    struct {
        unsigned OPA1OFCSEL0            :1;
        unsigned OPA1OFCSEL1            :1;
    };
} OPA1CON4bits_t;
extern volatile OPA1CON4bits_t OPA1CON4bits __at(0x123);
// bitfield macros
#define _OPA1CON4_OFCSEL_POSN                               0x0
#define _OPA1CON4_OFCSEL_POSITION                           0x0
#define _OPA1CON4_OFCSEL_SIZE                               0x2
#define _OPA1CON4_OFCSEL_LENGTH                             0x2
#define _OPA1CON4_OFCSEL_MASK                               0x3
#define _OPA1CON4_OFCST_POSN                                0x2
#define _OPA1CON4_OFCST_POSITION                            0x2
#define _OPA1CON4_OFCST_SIZE                                0x1
#define _OPA1CON4_OFCST_LENGTH                              0x1
#define _OPA1CON4_OFCST_MASK                                0x4
#define _OPA1CON4_PTRES_POSN                                0x4
#define _OPA1CON4_PTRES_POSITION                            0x4
#define _OPA1CON4_PTRES_SIZE                                0x1
#define _OPA1CON4_PTRES_LENGTH                              0x1
#define _OPA1CON4_PTRES_MASK                                0x10
#define _OPA1CON4_OFCSEL0_POSN                              0x0
#define _OPA1CON4_OFCSEL0_POSITION                          0x0
#define _OPA1CON4_OFCSEL0_SIZE                              0x1
#define _OPA1CON4_OFCSEL0_LENGTH                            0x1
#define _OPA1CON4_OFCSEL0_MASK                              0x1
#define _OPA1CON4_OFCSEL1_POSN                              0x1
#define _OPA1CON4_OFCSEL1_POSITION                          0x1
#define _OPA1CON4_OFCSEL1_SIZE                              0x1
#define _OPA1CON4_OFCSEL1_LENGTH                            0x1
#define _OPA1CON4_OFCSEL1_MASK                              0x2
#define _OPA1CON4_OPA1OFCSEL_POSN                           0x0
#define _OPA1CON4_OPA1OFCSEL_POSITION                       0x0
#define _OPA1CON4_OPA1OFCSEL_SIZE                           0x2
#define _OPA1CON4_OPA1OFCSEL_LENGTH                         0x2
#define _OPA1CON4_OPA1OFCSEL_MASK                           0x3
#define _OPA1CON4_OPA1OFCST_POSN                            0x2
#define _OPA1CON4_OPA1OFCST_POSITION                        0x2
#define _OPA1CON4_OPA1OFCST_SIZE                            0x1
#define _OPA1CON4_OPA1OFCST_LENGTH                          0x1
#define _OPA1CON4_OPA1OFCST_MASK                            0x4
#define _OPA1CON4_OPA1PTRES_POSN                            0x4
#define _OPA1CON4_OPA1PTRES_POSITION                        0x4
#define _OPA1CON4_OPA1PTRES_SIZE                            0x1
#define _OPA1CON4_OPA1PTRES_LENGTH                          0x1
#define _OPA1CON4_OPA1PTRES_MASK                            0x10
#define _OPA1CON4_OPA1OFCSEL0_POSN                          0x0
#define _OPA1CON4_OPA1OFCSEL0_POSITION                      0x0
#define _OPA1CON4_OPA1OFCSEL0_SIZE                          0x1
#define _OPA1CON4_OPA1OFCSEL0_LENGTH                        0x1
#define _OPA1CON4_OPA1OFCSEL0_MASK                          0x1
#define _OPA1CON4_OPA1OFCSEL1_POSN                          0x1
#define _OPA1CON4_OPA1OFCSEL1_POSITION                      0x1
#define _OPA1CON4_OPA1OFCSEL1_SIZE                          0x1
#define _OPA1CON4_OPA1OFCSEL1_LENGTH                        0x1
#define _OPA1CON4_OPA1OFCSEL1_MASK                          0x2

// Register: OPA1HWC
#define OPA1HWC OPA1HWC
extern volatile unsigned char           OPA1HWC             __at(0x124);
#ifndef _LIB_BUILD
asm("OPA1HWC equ 0124h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned HWCL                   :3;
        unsigned ORPOL                  :1;
        unsigned HWCH                   :3;
        unsigned OREN                   :1;
    };
    struct {
        unsigned HWCL0                  :1;
        unsigned HWCL1                  :1;
        unsigned HWCL2                  :1;
        unsigned                        :1;
        unsigned HWCH0                  :1;
        unsigned HWCH1                  :1;
        unsigned HWCH2                  :1;
    };
    struct {
        unsigned OPA1HWCL               :3;
        unsigned OPA1ORPOL              :1;
        unsigned OPA1HWCH               :3;
        unsigned OPA1OREN               :1;
    };
    struct {
        unsigned OPA1HWCL0              :1;
        unsigned OPA1HWCL1              :1;
        unsigned OPA1HWCL2              :1;
        unsigned                        :1;
        unsigned OPA1HWCH0              :1;
        unsigned OPA1HWCH1              :1;
        unsigned OPA1HWCH2              :1;
    };
} OPA1HWCbits_t;
