GopalSaraf/Practicals/PSDL/include/proc/pic18f56q71.h
extern volatile OPA1HWCbits_t OPA1HWCbits __at(0x124);
// bitfield macros
#define _OPA1HWC_HWCL_POSN                                  0x0
#define _OPA1HWC_HWCL_POSITION                              0x0
#define _OPA1HWC_HWCL_SIZE                                  0x3
#define _OPA1HWC_HWCL_LENGTH                                0x3
#define _OPA1HWC_HWCL_MASK                                  0x7
#define _OPA1HWC_ORPOL_POSN                                 0x3
#define _OPA1HWC_ORPOL_POSITION                             0x3
#define _OPA1HWC_ORPOL_SIZE                                 0x1
#define _OPA1HWC_ORPOL_LENGTH                               0x1
#define _OPA1HWC_ORPOL_MASK                                 0x8
#define _OPA1HWC_HWCH_POSN                                  0x4
#define _OPA1HWC_HWCH_POSITION                              0x4
#define _OPA1HWC_HWCH_SIZE                                  0x3
#define _OPA1HWC_HWCH_LENGTH                                0x3
#define _OPA1HWC_HWCH_MASK                                  0x70
#define _OPA1HWC_OREN_POSN                                  0x7
#define _OPA1HWC_OREN_POSITION                              0x7
#define _OPA1HWC_OREN_SIZE                                  0x1
#define _OPA1HWC_OREN_LENGTH                                0x1
#define _OPA1HWC_OREN_MASK                                  0x80
#define _OPA1HWC_HWCL0_POSN                                 0x0
#define _OPA1HWC_HWCL0_POSITION                             0x0
#define _OPA1HWC_HWCL0_SIZE                                 0x1
#define _OPA1HWC_HWCL0_LENGTH                               0x1
#define _OPA1HWC_HWCL0_MASK                                 0x1
#define _OPA1HWC_HWCL1_POSN                                 0x1
#define _OPA1HWC_HWCL1_POSITION                             0x1
#define _OPA1HWC_HWCL1_SIZE                                 0x1
#define _OPA1HWC_HWCL1_LENGTH                               0x1
#define _OPA1HWC_HWCL1_MASK                                 0x2
#define _OPA1HWC_HWCL2_POSN                                 0x2
#define _OPA1HWC_HWCL2_POSITION                             0x2
#define _OPA1HWC_HWCL2_SIZE                                 0x1
#define _OPA1HWC_HWCL2_LENGTH                               0x1
#define _OPA1HWC_HWCL2_MASK                                 0x4
#define _OPA1HWC_HWCH0_POSN                                 0x4
#define _OPA1HWC_HWCH0_POSITION                             0x4
#define _OPA1HWC_HWCH0_SIZE                                 0x1
#define _OPA1HWC_HWCH0_LENGTH                               0x1
#define _OPA1HWC_HWCH0_MASK                                 0x10
#define _OPA1HWC_HWCH1_POSN                                 0x5
#define _OPA1HWC_HWCH1_POSITION                             0x5
#define _OPA1HWC_HWCH1_SIZE                                 0x1
#define _OPA1HWC_HWCH1_LENGTH                               0x1
#define _OPA1HWC_HWCH1_MASK                                 0x20
#define _OPA1HWC_HWCH2_POSN                                 0x6
#define _OPA1HWC_HWCH2_POSITION                             0x6
#define _OPA1HWC_HWCH2_SIZE                                 0x1
#define _OPA1HWC_HWCH2_LENGTH                               0x1
#define _OPA1HWC_HWCH2_MASK                                 0x40
#define _OPA1HWC_OPA1HWCL_POSN                              0x0
#define _OPA1HWC_OPA1HWCL_POSITION                          0x0
#define _OPA1HWC_OPA1HWCL_SIZE                              0x3
#define _OPA1HWC_OPA1HWCL_LENGTH                            0x3
#define _OPA1HWC_OPA1HWCL_MASK                              0x7
#define _OPA1HWC_OPA1ORPOL_POSN                             0x3
#define _OPA1HWC_OPA1ORPOL_POSITION                         0x3
#define _OPA1HWC_OPA1ORPOL_SIZE                             0x1
#define _OPA1HWC_OPA1ORPOL_LENGTH                           0x1
#define _OPA1HWC_OPA1ORPOL_MASK                             0x8
#define _OPA1HWC_OPA1HWCH_POSN                              0x4
#define _OPA1HWC_OPA1HWCH_POSITION                          0x4
#define _OPA1HWC_OPA1HWCH_SIZE                              0x3
#define _OPA1HWC_OPA1HWCH_LENGTH                            0x3
#define _OPA1HWC_OPA1HWCH_MASK                              0x70
#define _OPA1HWC_OPA1OREN_POSN                              0x7
#define _OPA1HWC_OPA1OREN_POSITION                          0x7
#define _OPA1HWC_OPA1OREN_SIZE                              0x1
#define _OPA1HWC_OPA1OREN_LENGTH                            0x1
#define _OPA1HWC_OPA1OREN_MASK                              0x80
#define _OPA1HWC_OPA1HWCL0_POSN                             0x0
#define _OPA1HWC_OPA1HWCL0_POSITION                         0x0
#define _OPA1HWC_OPA1HWCL0_SIZE                             0x1
#define _OPA1HWC_OPA1HWCL0_LENGTH                           0x1
#define _OPA1HWC_OPA1HWCL0_MASK                             0x1
#define _OPA1HWC_OPA1HWCL1_POSN                             0x1
#define _OPA1HWC_OPA1HWCL1_POSITION                         0x1
#define _OPA1HWC_OPA1HWCL1_SIZE                             0x1
#define _OPA1HWC_OPA1HWCL1_LENGTH                           0x1
#define _OPA1HWC_OPA1HWCL1_MASK                             0x2
#define _OPA1HWC_OPA1HWCL2_POSN                             0x2
#define _OPA1HWC_OPA1HWCL2_POSITION                         0x2
#define _OPA1HWC_OPA1HWCL2_SIZE                             0x1
#define _OPA1HWC_OPA1HWCL2_LENGTH                           0x1
#define _OPA1HWC_OPA1HWCL2_MASK                             0x4
#define _OPA1HWC_OPA1HWCH0_POSN                             0x4
#define _OPA1HWC_OPA1HWCH0_POSITION                         0x4
#define _OPA1HWC_OPA1HWCH0_SIZE                             0x1
#define _OPA1HWC_OPA1HWCH0_LENGTH                           0x1
#define _OPA1HWC_OPA1HWCH0_MASK                             0x10
#define _OPA1HWC_OPA1HWCH1_POSN                             0x5
#define _OPA1HWC_OPA1HWCH1_POSITION                         0x5
#define _OPA1HWC_OPA1HWCH1_SIZE                             0x1
#define _OPA1HWC_OPA1HWCH1_LENGTH                           0x1
#define _OPA1HWC_OPA1HWCH1_MASK                             0x20
#define _OPA1HWC_OPA1HWCH2_POSN                             0x6
#define _OPA1HWC_OPA1HWCH2_POSITION                         0x6
#define _OPA1HWC_OPA1HWCH2_SIZE                             0x1
#define _OPA1HWC_OPA1HWCH2_LENGTH                           0x1
#define _OPA1HWC_OPA1HWCH2_MASK                             0x40

// Register: OPA1OFFSET
#define OPA1OFFSET OPA1OFFSET
extern volatile unsigned char           OPA1OFFSET          __at(0x125);
#ifndef _LIB_BUILD
asm("OPA1OFFSET equ 0125h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned OFFSET                 :8;
    };
    struct {
        unsigned OFFSET0                :1;
        unsigned OFFSET1                :1;
        unsigned OFFSET2                :1;
        unsigned OFFSET3                :1;
        unsigned OFFSET4                :1;
        unsigned OFFSET5                :1;
        unsigned OFFSET6                :1;
        unsigned OFFSET7                :1;
    };
    struct {
        unsigned OPA1OFFSET             :8;
    };
    struct {
        unsigned OPA1OFFSET0            :1;
        unsigned OPA1OFFSET1            :1;
        unsigned OPA1OFFSET2            :1;
        unsigned OPA1OFFSET3            :1;
        unsigned OPA1OFFSET4            :1;
        unsigned OPA1OFFSET5            :1;
        unsigned OPA1OFFSET6            :1;
        unsigned OPA1OFFSET7            :1;
    };
} OPA1OFFSETbits_t;
