GopalSaraf/Practicals/PSDL/include/proc/pic18f56q71.h
// Register: OPA2CON2
#define OPA2CON2 OPA2CON2
extern volatile unsigned char           OPA2CON2            __at(0x129);
#ifndef _LIB_BUILD
asm("OPA2CON2 equ 0129h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PCH                    :3;
        unsigned                        :1;
        unsigned NCH                    :3;
    };
    struct {
        unsigned PCH0                   :1;
        unsigned PCH1                   :1;
        unsigned PCH2                   :1;
        unsigned                        :1;
        unsigned NCH0                   :1;
        unsigned NCH1                   :1;
        unsigned NCH2                   :1;
    };
    struct {
        unsigned OPA2PCH                :3;
        unsigned                        :1;
        unsigned OPA2NCH                :3;
    };
    struct {
        unsigned OPA2PCH0               :1;
        unsigned OPA2PCH1               :1;
        unsigned OPA2PCH2               :1;
        unsigned                        :1;
        unsigned OPA2NCH0               :1;
        unsigned OPA2NCH1               :1;
        unsigned OPA2NCH2               :1;
    };
} OPA2CON2bits_t;
extern volatile OPA2CON2bits_t OPA2CON2bits __at(0x129);
// bitfield macros
#define _OPA2CON2_PCH_POSN                                  0x0
#define _OPA2CON2_PCH_POSITION                              0x0
#define _OPA2CON2_PCH_SIZE                                  0x3
#define _OPA2CON2_PCH_LENGTH                                0x3
#define _OPA2CON2_PCH_MASK                                  0x7
#define _OPA2CON2_NCH_POSN                                  0x4
#define _OPA2CON2_NCH_POSITION                              0x4
#define _OPA2CON2_NCH_SIZE                                  0x3
#define _OPA2CON2_NCH_LENGTH                                0x3
#define _OPA2CON2_NCH_MASK                                  0x70
#define _OPA2CON2_PCH0_POSN                                 0x0
#define _OPA2CON2_PCH0_POSITION                             0x0
#define _OPA2CON2_PCH0_SIZE                                 0x1
#define _OPA2CON2_PCH0_LENGTH                               0x1
#define _OPA2CON2_PCH0_MASK                                 0x1
#define _OPA2CON2_PCH1_POSN                                 0x1
#define _OPA2CON2_PCH1_POSITION                             0x1
#define _OPA2CON2_PCH1_SIZE                                 0x1
#define _OPA2CON2_PCH1_LENGTH                               0x1
#define _OPA2CON2_PCH1_MASK                                 0x2
#define _OPA2CON2_PCH2_POSN                                 0x2
#define _OPA2CON2_PCH2_POSITION                             0x2
#define _OPA2CON2_PCH2_SIZE                                 0x1
#define _OPA2CON2_PCH2_LENGTH                               0x1
#define _OPA2CON2_PCH2_MASK                                 0x4
#define _OPA2CON2_NCH0_POSN                                 0x4
#define _OPA2CON2_NCH0_POSITION                             0x4
#define _OPA2CON2_NCH0_SIZE                                 0x1
#define _OPA2CON2_NCH0_LENGTH                               0x1
#define _OPA2CON2_NCH0_MASK                                 0x10
#define _OPA2CON2_NCH1_POSN                                 0x5
#define _OPA2CON2_NCH1_POSITION                             0x5
#define _OPA2CON2_NCH1_SIZE                                 0x1
#define _OPA2CON2_NCH1_LENGTH                               0x1
#define _OPA2CON2_NCH1_MASK                                 0x20
#define _OPA2CON2_NCH2_POSN                                 0x6
#define _OPA2CON2_NCH2_POSITION                             0x6
#define _OPA2CON2_NCH2_SIZE                                 0x1
#define _OPA2CON2_NCH2_LENGTH                               0x1
#define _OPA2CON2_NCH2_MASK                                 0x40
#define _OPA2CON2_OPA2PCH_POSN                              0x0
#define _OPA2CON2_OPA2PCH_POSITION                          0x0
#define _OPA2CON2_OPA2PCH_SIZE                              0x3
#define _OPA2CON2_OPA2PCH_LENGTH                            0x3
#define _OPA2CON2_OPA2PCH_MASK                              0x7
#define _OPA2CON2_OPA2NCH_POSN                              0x4
#define _OPA2CON2_OPA2NCH_POSITION                          0x4
#define _OPA2CON2_OPA2NCH_SIZE                              0x3
#define _OPA2CON2_OPA2NCH_LENGTH                            0x3
#define _OPA2CON2_OPA2NCH_MASK                              0x70
#define _OPA2CON2_OPA2PCH0_POSN                             0x0
#define _OPA2CON2_OPA2PCH0_POSITION                         0x0
#define _OPA2CON2_OPA2PCH0_SIZE                             0x1
#define _OPA2CON2_OPA2PCH0_LENGTH                           0x1
#define _OPA2CON2_OPA2PCH0_MASK                             0x1
#define _OPA2CON2_OPA2PCH1_POSN                             0x1
#define _OPA2CON2_OPA2PCH1_POSITION                         0x1
#define _OPA2CON2_OPA2PCH1_SIZE                             0x1
#define _OPA2CON2_OPA2PCH1_LENGTH                           0x1
#define _OPA2CON2_OPA2PCH1_MASK                             0x2
#define _OPA2CON2_OPA2PCH2_POSN                             0x2
#define _OPA2CON2_OPA2PCH2_POSITION                         0x2
#define _OPA2CON2_OPA2PCH2_SIZE                             0x1
#define _OPA2CON2_OPA2PCH2_LENGTH                           0x1
#define _OPA2CON2_OPA2PCH2_MASK                             0x4
#define _OPA2CON2_OPA2NCH0_POSN                             0x4
#define _OPA2CON2_OPA2NCH0_POSITION                         0x4
#define _OPA2CON2_OPA2NCH0_SIZE                             0x1
#define _OPA2CON2_OPA2NCH0_LENGTH                           0x1
#define _OPA2CON2_OPA2NCH0_MASK                             0x10
#define _OPA2CON2_OPA2NCH1_POSN                             0x5
#define _OPA2CON2_OPA2NCH1_POSITION                         0x5
#define _OPA2CON2_OPA2NCH1_SIZE                             0x1
#define _OPA2CON2_OPA2NCH1_LENGTH                           0x1
#define _OPA2CON2_OPA2NCH1_MASK                             0x20
#define _OPA2CON2_OPA2NCH2_POSN                             0x6
#define _OPA2CON2_OPA2NCH2_POSITION                         0x6
#define _OPA2CON2_OPA2NCH2_SIZE                             0x1
#define _OPA2CON2_OPA2NCH2_LENGTH                           0x1
#define _OPA2CON2_OPA2NCH2_MASK                             0x40

// Register: OPA2CON3
#define OPA2CON3 OPA2CON3
extern volatile unsigned char           OPA2CON3            __at(0x12A);
#ifndef _LIB_BUILD
asm("OPA2CON3 equ 012Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PSS                    :5;
        unsigned INTOE                  :1;
        unsigned FMS                    :2;
    };
    struct {
        unsigned PSS0                   :1;
        unsigned PSS1                   :1;
        unsigned                        :4;
        unsigned FMS0                   :1;
        unsigned FMS1                   :1;
    };
    struct {
        unsigned OPA2PSS                :5;
        unsigned OPA2INTOE              :1;
        unsigned OPA2FMS                :2;
    };
    struct {
        unsigned OPA2PSS0               :1;
        unsigned OPA2PSS1               :1;
        unsigned                        :4;
        unsigned OPA2FMS0               :1;
        unsigned OPA2FMS1               :1;
    };
} OPA2CON3bits_t;
extern volatile OPA2CON3bits_t OPA2CON3bits __at(0x12A);
// bitfield macros
#define _OPA2CON3_PSS_POSN                                  0x0
#define _OPA2CON3_PSS_POSITION                              0x0
#define _OPA2CON3_PSS_SIZE                                  0x5
#define _OPA2CON3_PSS_LENGTH                                0x5
#define _OPA2CON3_PSS_MASK                                  0x1F
#define _OPA2CON3_INTOE_POSN                                0x5
#define _OPA2CON3_INTOE_POSITION                            0x5
#define _OPA2CON3_INTOE_SIZE                                0x1
#define _OPA2CON3_INTOE_LENGTH                              0x1
#define _OPA2CON3_INTOE_MASK                                0x20
#define _OPA2CON3_FMS_POSN                                  0x6
#define _OPA2CON3_FMS_POSITION                              0x6
#define _OPA2CON3_FMS_SIZE                                  0x2
#define _OPA2CON3_FMS_LENGTH                                0x2
#define _OPA2CON3_FMS_MASK                                  0xC0
#define _OPA2CON3_PSS0_POSN                                 0x0
#define _OPA2CON3_PSS0_POSITION                             0x0
#define _OPA2CON3_PSS0_SIZE                                 0x1
#define _OPA2CON3_PSS0_LENGTH                               0x1
#define _OPA2CON3_PSS0_MASK                                 0x1
#define _OPA2CON3_PSS1_POSN                                 0x1
#define _OPA2CON3_PSS1_POSITION                             0x1
#define _OPA2CON3_PSS1_SIZE                                 0x1
#define _OPA2CON3_PSS1_LENGTH                               0x1
#define _OPA2CON3_PSS1_MASK                                 0x2
#define _OPA2CON3_FMS0_POSN                                 0x6
#define _OPA2CON3_FMS0_POSITION                             0x6
#define _OPA2CON3_FMS0_SIZE                                 0x1
#define _OPA2CON3_FMS0_LENGTH                               0x1
#define _OPA2CON3_FMS0_MASK                                 0x40
#define _OPA2CON3_FMS1_POSN                                 0x7
#define _OPA2CON3_FMS1_POSITION                             0x7
#define _OPA2CON3_FMS1_SIZE                                 0x1
#define _OPA2CON3_FMS1_LENGTH                               0x1
#define _OPA2CON3_FMS1_MASK                                 0x80
#define _OPA2CON3_OPA2PSS_POSN                              0x0
#define _OPA2CON3_OPA2PSS_POSITION                          0x0
#define _OPA2CON3_OPA2PSS_SIZE                              0x5
#define _OPA2CON3_OPA2PSS_LENGTH                            0x5
#define _OPA2CON3_OPA2PSS_MASK                              0x1F
#define _OPA2CON3_OPA2INTOE_POSN                            0x5
#define _OPA2CON3_OPA2INTOE_POSITION                        0x5
#define _OPA2CON3_OPA2INTOE_SIZE                            0x1
#define _OPA2CON3_OPA2INTOE_LENGTH                          0x1
#define _OPA2CON3_OPA2INTOE_MASK                            0x20
#define _OPA2CON3_OPA2FMS_POSN                              0x6
#define _OPA2CON3_OPA2FMS_POSITION                          0x6
#define _OPA2CON3_OPA2FMS_SIZE                              0x2
#define _OPA2CON3_OPA2FMS_LENGTH                            0x2
#define _OPA2CON3_OPA2FMS_MASK                              0xC0
#define _OPA2CON3_OPA2PSS0_POSN                             0x0
#define _OPA2CON3_OPA2PSS0_POSITION                         0x0
#define _OPA2CON3_OPA2PSS0_SIZE                             0x1
#define _OPA2CON3_OPA2PSS0_LENGTH                           0x1
#define _OPA2CON3_OPA2PSS0_MASK                             0x1
#define _OPA2CON3_OPA2PSS1_POSN                             0x1
#define _OPA2CON3_OPA2PSS1_POSITION                         0x1
#define _OPA2CON3_OPA2PSS1_SIZE                             0x1
#define _OPA2CON3_OPA2PSS1_LENGTH                           0x1
#define _OPA2CON3_OPA2PSS1_MASK                             0x2
#define _OPA2CON3_OPA2FMS0_POSN                             0x6
#define _OPA2CON3_OPA2FMS0_POSITION                         0x6
#define _OPA2CON3_OPA2FMS0_SIZE                             0x1
#define _OPA2CON3_OPA2FMS0_LENGTH                           0x1
#define _OPA2CON3_OPA2FMS0_MASK                             0x40
#define _OPA2CON3_OPA2FMS1_POSN                             0x7
#define _OPA2CON3_OPA2FMS1_POSITION                         0x7
#define _OPA2CON3_OPA2FMS1_SIZE                             0x1
#define _OPA2CON3_OPA2FMS1_LENGTH                           0x1
#define _OPA2CON3_OPA2FMS1_MASK                             0x80

// Register: OPA2CON4
#define OPA2CON4 OPA2CON4
extern volatile unsigned char           OPA2CON4            __at(0x12B);
#ifndef _LIB_BUILD
asm("OPA2CON4 equ 012Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned OFCSEL                 :2;
        unsigned OFCST                  :1;
        unsigned                        :1;
        unsigned PTRES                  :1;
    };
    struct {
        unsigned OFCSEL0                :1;
        unsigned OFCSEL1                :1;
    };
    struct {
        unsigned OPA2OFCSEL             :2;
        unsigned OPA2OFCST              :1;
        unsigned                        :1;
        unsigned OPA2PTRES              :1;
    };
    struct {
        unsigned OPA2OFCSEL0            :1;
        unsigned OPA2OFCSEL1            :1;
    };
} OPA2CON4bits_t;
extern volatile OPA2CON4bits_t OPA2CON4bits __at(0x12B);
// bitfield macros
#define _OPA2CON4_OFCSEL_POSN                               0x0
#define _OPA2CON4_OFCSEL_POSITION                           0x0
#define _OPA2CON4_OFCSEL_SIZE                               0x2
#define _OPA2CON4_OFCSEL_LENGTH                             0x2
#define _OPA2CON4_OFCSEL_MASK                               0x3
#define _OPA2CON4_OFCST_POSN                                0x2
#define _OPA2CON4_OFCST_POSITION                            0x2
#define _OPA2CON4_OFCST_SIZE                                0x1
#define _OPA2CON4_OFCST_LENGTH                              0x1
#define _OPA2CON4_OFCST_MASK                                0x4
#define _OPA2CON4_PTRES_POSN                                0x4
#define _OPA2CON4_PTRES_POSITION                            0x4
#define _OPA2CON4_PTRES_SIZE                                0x1
#define _OPA2CON4_PTRES_LENGTH                              0x1
#define _OPA2CON4_PTRES_MASK                                0x10
#define _OPA2CON4_OFCSEL0_POSN                              0x0
#define _OPA2CON4_OFCSEL0_POSITION                          0x0
#define _OPA2CON4_OFCSEL0_SIZE                              0x1
#define _OPA2CON4_OFCSEL0_LENGTH                            0x1
#define _OPA2CON4_OFCSEL0_MASK                              0x1
#define _OPA2CON4_OFCSEL1_POSN                              0x1
#define _OPA2CON4_OFCSEL1_POSITION                          0x1
#define _OPA2CON4_OFCSEL1_SIZE                              0x1
#define _OPA2CON4_OFCSEL1_LENGTH                            0x1
#define _OPA2CON4_OFCSEL1_MASK                              0x2
#define _OPA2CON4_OPA2OFCSEL_POSN                           0x0
#define _OPA2CON4_OPA2OFCSEL_POSITION                       0x0
#define _OPA2CON4_OPA2OFCSEL_SIZE                           0x2
#define _OPA2CON4_OPA2OFCSEL_LENGTH                         0x2
#define _OPA2CON4_OPA2OFCSEL_MASK                           0x3
#define _OPA2CON4_OPA2OFCST_POSN                            0x2
#define _OPA2CON4_OPA2OFCST_POSITION                        0x2
#define _OPA2CON4_OPA2OFCST_SIZE                            0x1
#define _OPA2CON4_OPA2OFCST_LENGTH                          0x1
#define _OPA2CON4_OPA2OFCST_MASK                            0x4
#define _OPA2CON4_OPA2PTRES_POSN                            0x4
#define _OPA2CON4_OPA2PTRES_POSITION                        0x4
#define _OPA2CON4_OPA2PTRES_SIZE                            0x1
#define _OPA2CON4_OPA2PTRES_LENGTH                          0x1
#define _OPA2CON4_OPA2PTRES_MASK                            0x10
#define _OPA2CON4_OPA2OFCSEL0_POSN                          0x0
#define _OPA2CON4_OPA2OFCSEL0_POSITION                      0x0
#define _OPA2CON4_OPA2OFCSEL0_SIZE                          0x1
#define _OPA2CON4_OPA2OFCSEL0_LENGTH                        0x1
#define _OPA2CON4_OPA2OFCSEL0_MASK                          0x1
#define _OPA2CON4_OPA2OFCSEL1_POSN                          0x1
#define _OPA2CON4_OPA2OFCSEL1_POSITION                      0x1
#define _OPA2CON4_OPA2OFCSEL1_SIZE                          0x1
#define _OPA2CON4_OPA2OFCSEL1_LENGTH                        0x1
#define _OPA2CON4_OPA2OFCSEL1_MASK                          0x2

// Register: OPA2HWC
#define OPA2HWC OPA2HWC
extern volatile unsigned char           OPA2HWC             __at(0x12C);
#ifndef _LIB_BUILD
asm("OPA2HWC equ 012Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned HWCL                   :3;
        unsigned ORPOL                  :1;
        unsigned HWCH                   :3;
        unsigned OREN                   :1;
    };
    struct {
        unsigned HWCL0                  :1;
        unsigned HWCL1                  :1;
        unsigned HWCL2                  :1;
        unsigned                        :1;
        unsigned HWCH0                  :1;
        unsigned HWCH1                  :1;
        unsigned HWCH2                  :1;
    };
    struct {
        unsigned OPA2HWCL               :3;
        unsigned OPA2ORPOL              :1;
        unsigned OPA2HWCH               :3;
        unsigned OPA2OREN               :1;
    };
    struct {
        unsigned OPA2HWCL0              :1;
        unsigned OPA2HWCL1              :1;
        unsigned OPA2HWCL2              :1;
        unsigned                        :1;
        unsigned OPA2HWCH0              :1;
        unsigned OPA2HWCH1              :1;
        unsigned OPA2HWCH2              :1;
    };
} OPA2HWCbits_t;
extern volatile OPA2HWCbits_t OPA2HWCbits __at(0x12C);
// bitfield macros
#define _OPA2HWC_HWCL_POSN                                  0x0
#define _OPA2HWC_HWCL_POSITION                              0x0
#define _OPA2HWC_HWCL_SIZE                                  0x3
#define _OPA2HWC_HWCL_LENGTH                                0x3
#define _OPA2HWC_HWCL_MASK                                  0x7
#define _OPA2HWC_ORPOL_POSN                                 0x3
#define _OPA2HWC_ORPOL_POSITION                             0x3
#define _OPA2HWC_ORPOL_SIZE                                 0x1
#define _OPA2HWC_ORPOL_LENGTH                               0x1
#define _OPA2HWC_ORPOL_MASK                                 0x8
#define _OPA2HWC_HWCH_POSN                                  0x4
#define _OPA2HWC_HWCH_POSITION                              0x4
#define _OPA2HWC_HWCH_SIZE                                  0x3
#define _OPA2HWC_HWCH_LENGTH                                0x3
#define _OPA2HWC_HWCH_MASK                                  0x70
#define _OPA2HWC_OREN_POSN                                  0x7
#define _OPA2HWC_OREN_POSITION                              0x7
#define _OPA2HWC_OREN_SIZE                                  0x1
#define _OPA2HWC_OREN_LENGTH                                0x1
#define _OPA2HWC_OREN_MASK                                  0x80
#define _OPA2HWC_HWCL0_POSN                                 0x0
#define _OPA2HWC_HWCL0_POSITION                             0x0
#define _OPA2HWC_HWCL0_SIZE                                 0x1
#define _OPA2HWC_HWCL0_LENGTH                               0x1
#define _OPA2HWC_HWCL0_MASK                                 0x1
#define _OPA2HWC_HWCL1_POSN                                 0x1
#define _OPA2HWC_HWCL1_POSITION                             0x1
#define _OPA2HWC_HWCL1_SIZE                                 0x1
#define _OPA2HWC_HWCL1_LENGTH                               0x1
#define _OPA2HWC_HWCL1_MASK                                 0x2
#define _OPA2HWC_HWCL2_POSN                                 0x2
#define _OPA2HWC_HWCL2_POSITION                             0x2
#define _OPA2HWC_HWCL2_SIZE                                 0x1
#define _OPA2HWC_HWCL2_LENGTH                               0x1
#define _OPA2HWC_HWCL2_MASK                                 0x4
#define _OPA2HWC_HWCH0_POSN                                 0x4
#define _OPA2HWC_HWCH0_POSITION                             0x4
#define _OPA2HWC_HWCH0_SIZE                                 0x1
#define _OPA2HWC_HWCH0_LENGTH                               0x1
#define _OPA2HWC_HWCH0_MASK                                 0x10
#define _OPA2HWC_HWCH1_POSN                                 0x5
#define _OPA2HWC_HWCH1_POSITION                             0x5
#define _OPA2HWC_HWCH1_SIZE                                 0x1
#define _OPA2HWC_HWCH1_LENGTH                               0x1
#define _OPA2HWC_HWCH1_MASK                                 0x20
#define _OPA2HWC_HWCH2_POSN                                 0x6
#define _OPA2HWC_HWCH2_POSITION                             0x6
#define _OPA2HWC_HWCH2_SIZE                                 0x1
#define _OPA2HWC_HWCH2_LENGTH                               0x1
#define _OPA2HWC_HWCH2_MASK                                 0x40
#define _OPA2HWC_OPA2HWCL_POSN                              0x0
#define _OPA2HWC_OPA2HWCL_POSITION                          0x0
#define _OPA2HWC_OPA2HWCL_SIZE                              0x3
#define _OPA2HWC_OPA2HWCL_LENGTH                            0x3
#define _OPA2HWC_OPA2HWCL_MASK                              0x7
#define _OPA2HWC_OPA2ORPOL_POSN                             0x3
#define _OPA2HWC_OPA2ORPOL_POSITION                         0x3
#define _OPA2HWC_OPA2ORPOL_SIZE                             0x1
#define _OPA2HWC_OPA2ORPOL_LENGTH                           0x1
#define _OPA2HWC_OPA2ORPOL_MASK                             0x8
#define _OPA2HWC_OPA2HWCH_POSN                              0x4
#define _OPA2HWC_OPA2HWCH_POSITION                          0x4
#define _OPA2HWC_OPA2HWCH_SIZE                              0x3
#define _OPA2HWC_OPA2HWCH_LENGTH                            0x3
#define _OPA2HWC_OPA2HWCH_MASK                              0x70
#define _OPA2HWC_OPA2OREN_POSN                              0x7
#define _OPA2HWC_OPA2OREN_POSITION                          0x7
#define _OPA2HWC_OPA2OREN_SIZE                              0x1
#define _OPA2HWC_OPA2OREN_LENGTH                            0x1
#define _OPA2HWC_OPA2OREN_MASK                              0x80
#define _OPA2HWC_OPA2HWCL0_POSN                             0x0
#define _OPA2HWC_OPA2HWCL0_POSITION                         0x0
#define _OPA2HWC_OPA2HWCL0_SIZE                             0x1
#define _OPA2HWC_OPA2HWCL0_LENGTH                           0x1
#define _OPA2HWC_OPA2HWCL0_MASK                             0x1
#define _OPA2HWC_OPA2HWCL1_POSN                             0x1
#define _OPA2HWC_OPA2HWCL1_POSITION                         0x1
#define _OPA2HWC_OPA2HWCL1_SIZE                             0x1
#define _OPA2HWC_OPA2HWCL1_LENGTH                           0x1
#define _OPA2HWC_OPA2HWCL1_MASK                             0x2
#define _OPA2HWC_OPA2HWCL2_POSN                             0x2
#define _OPA2HWC_OPA2HWCL2_POSITION                         0x2
#define _OPA2HWC_OPA2HWCL2_SIZE                             0x1
#define _OPA2HWC_OPA2HWCL2_LENGTH                           0x1
#define _OPA2HWC_OPA2HWCL2_MASK                             0x4
#define _OPA2HWC_OPA2HWCH0_POSN                             0x4
#define _OPA2HWC_OPA2HWCH0_POSITION                         0x4
#define _OPA2HWC_OPA2HWCH0_SIZE                             0x1
#define _OPA2HWC_OPA2HWCH0_LENGTH                           0x1
#define _OPA2HWC_OPA2HWCH0_MASK                             0x10
#define _OPA2HWC_OPA2HWCH1_POSN                             0x5
#define _OPA2HWC_OPA2HWCH1_POSITION                         0x5
#define _OPA2HWC_OPA2HWCH1_SIZE                             0x1
#define _OPA2HWC_OPA2HWCH1_LENGTH                           0x1
#define _OPA2HWC_OPA2HWCH1_MASK                             0x20
#define _OPA2HWC_OPA2HWCH2_POSN                             0x6
#define _OPA2HWC_OPA2HWCH2_POSITION                         0x6
#define _OPA2HWC_OPA2HWCH2_SIZE                             0x1
#define _OPA2HWC_OPA2HWCH2_LENGTH                           0x1
#define _OPA2HWC_OPA2HWCH2_MASK                             0x40

