GopalSaraf/Practicals/PSDL/include/proc/pic18f56q71.h
extern volatile U1TXBLbits_t U1TXBLbits __at(0x2A2);
// bitfield macros
#define _U1TXBL_TXB_POSN                                    0x0
#define _U1TXBL_TXB_POSITION                                0x0
#define _U1TXBL_TXB_SIZE                                    0x8
#define _U1TXBL_TXB_LENGTH                                  0x8
#define _U1TXBL_TXB_MASK                                    0xFF

// Register: U1TXCHK
#define U1TXCHK U1TXCHK
extern volatile unsigned char           U1TXCHK             __at(0x2A3);
#ifndef _LIB_BUILD
asm("U1TXCHK equ 02A3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXCHK                  :8;
    };
} U1TXCHKbits_t;
extern volatile U1TXCHKbits_t U1TXCHKbits __at(0x2A3);
// bitfield macros
#define _U1TXCHK_TXCHK_POSN                                 0x0
#define _U1TXCHK_TXCHK_POSITION                             0x0
#define _U1TXCHK_TXCHK_SIZE                                 0x8
#define _U1TXCHK_TXCHK_LENGTH                               0x8
#define _U1TXCHK_TXCHK_MASK                                 0xFF

// Register: U1P1
#define U1P1 U1P1
extern volatile unsigned short          U1P1                __at(0x2A4);
#ifndef _LIB_BUILD
asm("U1P1 equ 02A4h");
#endif

// Register: U1P1L
#define U1P1L U1P1L
extern volatile unsigned char           U1P1L               __at(0x2A4);
#ifndef _LIB_BUILD
asm("U1P1L equ 02A4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P1L                    :8;
    };
} U1P1Lbits_t;
extern volatile U1P1Lbits_t U1P1Lbits __at(0x2A4);
// bitfield macros
#define _U1P1L_P1L_POSN                                     0x0
#define _U1P1L_P1L_POSITION                                 0x0
#define _U1P1L_P1L_SIZE                                     0x8
#define _U1P1L_P1L_LENGTH                                   0x8
#define _U1P1L_P1L_MASK                                     0xFF

// Register: U1P1H
#define U1P1H U1P1H
extern volatile unsigned char           U1P1H               __at(0x2A5);
#ifndef _LIB_BUILD
asm("U1P1H equ 02A5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P1H                    :1;
    };
} U1P1Hbits_t;
extern volatile U1P1Hbits_t U1P1Hbits __at(0x2A5);
// bitfield macros
#define _U1P1H_P1H_POSN                                     0x0
#define _U1P1H_P1H_POSITION                                 0x0
#define _U1P1H_P1H_SIZE                                     0x1
#define _U1P1H_P1H_LENGTH                                   0x1
#define _U1P1H_P1H_MASK                                     0x1

// Register: U1P2
#define U1P2 U1P2
extern volatile unsigned short          U1P2                __at(0x2A6);
#ifndef _LIB_BUILD
asm("U1P2 equ 02A6h");
#endif

// Register: U1P2L
#define U1P2L U1P2L
extern volatile unsigned char           U1P2L               __at(0x2A6);
#ifndef _LIB_BUILD
asm("U1P2L equ 02A6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P2L                    :8;
    };
} U1P2Lbits_t;
extern volatile U1P2Lbits_t U1P2Lbits __at(0x2A6);
// bitfield macros
#define _U1P2L_P2L_POSN                                     0x0
#define _U1P2L_P2L_POSITION                                 0x0
#define _U1P2L_P2L_SIZE                                     0x8
#define _U1P2L_P2L_LENGTH                                   0x8
#define _U1P2L_P2L_MASK                                     0xFF

// Register: U1P2H
#define U1P2H U1P2H
extern volatile unsigned char           U1P2H               __at(0x2A7);
#ifndef _LIB_BUILD
asm("U1P2H equ 02A7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P2H                    :1;
    };
} U1P2Hbits_t;
extern volatile U1P2Hbits_t U1P2Hbits __at(0x2A7);
// bitfield macros
#define _U1P2H_P2H_POSN                                     0x0
#define _U1P2H_P2H_POSITION                                 0x0
#define _U1P2H_P2H_SIZE                                     0x1
#define _U1P2H_P2H_LENGTH                                   0x1
#define _U1P2H_P2H_MASK                                     0x1

// Register: U1P3
#define U1P3 U1P3
extern volatile unsigned short          U1P3                __at(0x2A8);
#ifndef _LIB_BUILD
asm("U1P3 equ 02A8h");
#endif

// Register: U1P3L
#define U1P3L U1P3L
extern volatile unsigned char           U1P3L               __at(0x2A8);
#ifndef _LIB_BUILD
asm("U1P3L equ 02A8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P3L                    :8;
    };
} U1P3Lbits_t;
extern volatile U1P3Lbits_t U1P3Lbits __at(0x2A8);
// bitfield macros
#define _U1P3L_P3L_POSN                                     0x0
#define _U1P3L_P3L_POSITION                                 0x0
#define _U1P3L_P3L_SIZE                                     0x8
#define _U1P3L_P3L_LENGTH                                   0x8
#define _U1P3L_P3L_MASK                                     0xFF

// Register: U1P3H
#define U1P3H U1P3H
extern volatile unsigned char           U1P3H               __at(0x2A9);
#ifndef _LIB_BUILD
asm("U1P3H equ 02A9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P3H                    :1;
    };
} U1P3Hbits_t;
extern volatile U1P3Hbits_t U1P3Hbits __at(0x2A9);
// bitfield macros
#define _U1P3H_P3H_POSN                                     0x0
#define _U1P3H_P3H_POSITION                                 0x0
#define _U1P3H_P3H_SIZE                                     0x1
#define _U1P3H_P3H_LENGTH                                   0x1
#define _U1P3H_P3H_MASK                                     0x1

// Register: U1CON0
#define U1CON0 U1CON0
extern volatile unsigned char           U1CON0              __at(0x2AA);
#ifndef _LIB_BUILD
asm("U1CON0 equ 02AAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MODE0                  :1;
        unsigned MODE1                  :1;
        unsigned MODE2                  :1;
        unsigned MODE3                  :1;
    };
    struct {
        unsigned U1MODE                 :4;
        unsigned U1RXEN                 :1;
        unsigned U1TXEN                 :1;
        unsigned U1ABDEN                :1;
        unsigned U1BRGS                 :1;
    };
    struct {
        unsigned U1MODE0                :1;
        unsigned U1MODE1                :1;
        unsigned U1MODE2                :1;
        unsigned U1MODE3                :1;
    };
    struct {
        unsigned MODE                   :4;
        unsigned RXEN                   :1;
        unsigned TXEN                   :1;
        unsigned ABDEN                  :1;
        unsigned BRGS                   :1;
    };
} U1CON0bits_t;
extern volatile U1CON0bits_t U1CON0bits __at(0x2AA);
// bitfield macros
#define _U1CON0_MODE0_POSN                                  0x0
#define _U1CON0_MODE0_POSITION                              0x0
#define _U1CON0_MODE0_SIZE                                  0x1
#define _U1CON0_MODE0_LENGTH                                0x1
#define _U1CON0_MODE0_MASK                                  0x1
#define _U1CON0_MODE1_POSN                                  0x1
#define _U1CON0_MODE1_POSITION                              0x1
#define _U1CON0_MODE1_SIZE                                  0x1
#define _U1CON0_MODE1_LENGTH                                0x1
#define _U1CON0_MODE1_MASK                                  0x2
#define _U1CON0_MODE2_POSN                                  0x2
#define _U1CON0_MODE2_POSITION                              0x2
#define _U1CON0_MODE2_SIZE                                  0x1
#define _U1CON0_MODE2_LENGTH                                0x1
#define _U1CON0_MODE2_MASK                                  0x4
#define _U1CON0_MODE3_POSN                                  0x3
#define _U1CON0_MODE3_POSITION                              0x3
#define _U1CON0_MODE3_SIZE                                  0x1
#define _U1CON0_MODE3_LENGTH                                0x1
#define _U1CON0_MODE3_MASK                                  0x8
#define _U1CON0_U1MODE_POSN                                 0x0
#define _U1CON0_U1MODE_POSITION                             0x0
#define _U1CON0_U1MODE_SIZE                                 0x4
#define _U1CON0_U1MODE_LENGTH                               0x4
#define _U1CON0_U1MODE_MASK                                 0xF
#define _U1CON0_U1RXEN_POSN                                 0x4
#define _U1CON0_U1RXEN_POSITION                             0x4
#define _U1CON0_U1RXEN_SIZE                                 0x1
#define _U1CON0_U1RXEN_LENGTH                               0x1
#define _U1CON0_U1RXEN_MASK                                 0x10
#define _U1CON0_U1TXEN_POSN                                 0x5
#define _U1CON0_U1TXEN_POSITION                             0x5
#define _U1CON0_U1TXEN_SIZE                                 0x1
#define _U1CON0_U1TXEN_LENGTH                               0x1
#define _U1CON0_U1TXEN_MASK                                 0x20
#define _U1CON0_U1ABDEN_POSN                                0x6
#define _U1CON0_U1ABDEN_POSITION                            0x6
#define _U1CON0_U1ABDEN_SIZE                                0x1
#define _U1CON0_U1ABDEN_LENGTH                              0x1
#define _U1CON0_U1ABDEN_MASK                                0x40
#define _U1CON0_U1BRGS_POSN                                 0x7
#define _U1CON0_U1BRGS_POSITION                             0x7
#define _U1CON0_U1BRGS_SIZE                                 0x1
#define _U1CON0_U1BRGS_LENGTH                               0x1
#define _U1CON0_U1BRGS_MASK                                 0x80
#define _U1CON0_U1MODE0_POSN                                0x0
#define _U1CON0_U1MODE0_POSITION                            0x0
#define _U1CON0_U1MODE0_SIZE                                0x1
#define _U1CON0_U1MODE0_LENGTH                              0x1
#define _U1CON0_U1MODE0_MASK                                0x1
#define _U1CON0_U1MODE1_POSN                                0x1
#define _U1CON0_U1MODE1_POSITION                            0x1
#define _U1CON0_U1MODE1_SIZE                                0x1
#define _U1CON0_U1MODE1_LENGTH                              0x1
#define _U1CON0_U1MODE1_MASK                                0x2
#define _U1CON0_U1MODE2_POSN                                0x2
#define _U1CON0_U1MODE2_POSITION                            0x2
#define _U1CON0_U1MODE2_SIZE                                0x1
#define _U1CON0_U1MODE2_LENGTH                              0x1
#define _U1CON0_U1MODE2_MASK                                0x4
#define _U1CON0_U1MODE3_POSN                                0x3
#define _U1CON0_U1MODE3_POSITION                            0x3
#define _U1CON0_U1MODE3_SIZE                                0x1
#define _U1CON0_U1MODE3_LENGTH                              0x1
#define _U1CON0_U1MODE3_MASK                                0x8
#define _U1CON0_MODE_POSN                                   0x0
#define _U1CON0_MODE_POSITION                               0x0
#define _U1CON0_MODE_SIZE                                   0x4
#define _U1CON0_MODE_LENGTH                                 0x4
#define _U1CON0_MODE_MASK                                   0xF
#define _U1CON0_RXEN_POSN                                   0x4
#define _U1CON0_RXEN_POSITION                               0x4
#define _U1CON0_RXEN_SIZE                                   0x1
#define _U1CON0_RXEN_LENGTH                                 0x1
#define _U1CON0_RXEN_MASK                                   0x10
#define _U1CON0_TXEN_POSN                                   0x5
#define _U1CON0_TXEN_POSITION                               0x5
#define _U1CON0_TXEN_SIZE                                   0x1
#define _U1CON0_TXEN_LENGTH                                 0x1
#define _U1CON0_TXEN_MASK                                   0x20
#define _U1CON0_ABDEN_POSN                                  0x6
#define _U1CON0_ABDEN_POSITION                              0x6
#define _U1CON0_ABDEN_SIZE                                  0x1
#define _U1CON0_ABDEN_LENGTH                                0x1
#define _U1CON0_ABDEN_MASK                                  0x40
#define _U1CON0_BRGS_POSN                                   0x7
#define _U1CON0_BRGS_POSITION                               0x7
#define _U1CON0_BRGS_SIZE                                   0x1
#define _U1CON0_BRGS_LENGTH                                 0x1
#define _U1CON0_BRGS_MASK                                   0x80

// Register: U1CON1
#define U1CON1 U1CON1
extern volatile unsigned char           U1CON1              __at(0x2AB);
#ifndef _LIB_BUILD
asm("U1CON1 equ 02ABh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SENDB                  :1;
        unsigned BRKOVR                 :1;
        unsigned                        :1;
        unsigned RXBIMD                 :1;
        unsigned WUE                    :1;
        unsigned                        :2;
        unsigned ON                     :1;
    };
    struct {
        unsigned U1SENDB                :1;
        unsigned U1BRKOVR               :1;
        unsigned                        :1;
        unsigned U1RXBIMD               :1;
        unsigned U1WUE                  :1;
        unsigned                        :2;
        unsigned U1ON                   :1;
    };
} U1CON1bits_t;
