GopalSaraf/Practicals/PSDL/include/proc/pic18f56q71.h
// Register: TU16BTMR
#define TU16BTMR TU16BTMR
extern volatile unsigned short          TU16BTMR            __at(0x3AE);
#ifndef _LIB_BUILD
asm("TU16BTMR equ 03AEh");
#endif
// aliases
extern volatile unsigned short          TU16BCR             __at(0x3AE);
#ifndef _LIB_BUILD
asm("TU16BCR equ 03AEh");
#endif

// Register: TU16BTMRL
#define TU16BTMRL TU16BTMRL
extern volatile unsigned char           TU16BTMRL           __at(0x3AE);
#ifndef _LIB_BUILD
asm("TU16BTMRL equ 03AEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMRL                   :8;
    };
    struct {
        unsigned TMRL0                  :1;
        unsigned TMRL1                  :1;
        unsigned TMRL2                  :1;
        unsigned TMRL3                  :1;
        unsigned TMRL4                  :1;
        unsigned TMRL5                  :1;
        unsigned TMRL6                  :1;
        unsigned TMRL7                  :1;
    };
    struct {
        unsigned TU16BTMRL0             :1;
        unsigned TU16BTMRL1             :1;
        unsigned TU16BTMRL2             :1;
        unsigned TU16BTMRL3             :1;
        unsigned TU16BTMRL4             :1;
        unsigned TU16BTMRL5             :1;
        unsigned TU16BTMRL6             :1;
        unsigned TU16BTMRL7             :1;
    };
    struct {
        unsigned TU16BTMR0              :1;
        unsigned TU16BTMR1              :1;
        unsigned TU16BTMR2              :1;
        unsigned TU16BTMR3              :1;
        unsigned TU16BTMR4              :1;
        unsigned TU16BTMR5              :1;
        unsigned TU16BTMR6              :1;
        unsigned TU16BTMR7              :1;
    };
} TU16BTMRLbits_t;
extern volatile TU16BTMRLbits_t TU16BTMRLbits __at(0x3AE);
// bitfield macros
#define _TU16BTMRL_TMRL_POSN                                0x0
#define _TU16BTMRL_TMRL_POSITION                            0x0
#define _TU16BTMRL_TMRL_SIZE                                0x8
#define _TU16BTMRL_TMRL_LENGTH                              0x8
#define _TU16BTMRL_TMRL_MASK                                0xFF
#define _TU16BTMRL_TMRL0_POSN                               0x0
#define _TU16BTMRL_TMRL0_POSITION                           0x0
#define _TU16BTMRL_TMRL0_SIZE                               0x1
#define _TU16BTMRL_TMRL0_LENGTH                             0x1
#define _TU16BTMRL_TMRL0_MASK                               0x1
#define _TU16BTMRL_TMRL1_POSN                               0x1
#define _TU16BTMRL_TMRL1_POSITION                           0x1
#define _TU16BTMRL_TMRL1_SIZE                               0x1
#define _TU16BTMRL_TMRL1_LENGTH                             0x1
#define _TU16BTMRL_TMRL1_MASK                               0x2
#define _TU16BTMRL_TMRL2_POSN                               0x2
#define _TU16BTMRL_TMRL2_POSITION                           0x2
#define _TU16BTMRL_TMRL2_SIZE                               0x1
#define _TU16BTMRL_TMRL2_LENGTH                             0x1
#define _TU16BTMRL_TMRL2_MASK                               0x4
#define _TU16BTMRL_TMRL3_POSN                               0x3
#define _TU16BTMRL_TMRL3_POSITION                           0x3
#define _TU16BTMRL_TMRL3_SIZE                               0x1
#define _TU16BTMRL_TMRL3_LENGTH                             0x1
#define _TU16BTMRL_TMRL3_MASK                               0x8
#define _TU16BTMRL_TMRL4_POSN                               0x4
#define _TU16BTMRL_TMRL4_POSITION                           0x4
#define _TU16BTMRL_TMRL4_SIZE                               0x1
#define _TU16BTMRL_TMRL4_LENGTH                             0x1
#define _TU16BTMRL_TMRL4_MASK                               0x10
#define _TU16BTMRL_TMRL5_POSN                               0x5
#define _TU16BTMRL_TMRL5_POSITION                           0x5
#define _TU16BTMRL_TMRL5_SIZE                               0x1
#define _TU16BTMRL_TMRL5_LENGTH                             0x1
#define _TU16BTMRL_TMRL5_MASK                               0x20
#define _TU16BTMRL_TMRL6_POSN                               0x6
#define _TU16BTMRL_TMRL6_POSITION                           0x6
#define _TU16BTMRL_TMRL6_SIZE                               0x1
#define _TU16BTMRL_TMRL6_LENGTH                             0x1
#define _TU16BTMRL_TMRL6_MASK                               0x40
#define _TU16BTMRL_TMRL7_POSN                               0x7
#define _TU16BTMRL_TMRL7_POSITION                           0x7
#define _TU16BTMRL_TMRL7_SIZE                               0x1
#define _TU16BTMRL_TMRL7_LENGTH                             0x1
#define _TU16BTMRL_TMRL7_MASK                               0x80
#define _TU16BTMRL_TU16BTMRL0_POSN                          0x0
#define _TU16BTMRL_TU16BTMRL0_POSITION                      0x0
#define _TU16BTMRL_TU16BTMRL0_SIZE                          0x1
#define _TU16BTMRL_TU16BTMRL0_LENGTH                        0x1
#define _TU16BTMRL_TU16BTMRL0_MASK                          0x1
#define _TU16BTMRL_TU16BTMRL1_POSN                          0x1
#define _TU16BTMRL_TU16BTMRL1_POSITION                      0x1
#define _TU16BTMRL_TU16BTMRL1_SIZE                          0x1
#define _TU16BTMRL_TU16BTMRL1_LENGTH                        0x1
#define _TU16BTMRL_TU16BTMRL1_MASK                          0x2
#define _TU16BTMRL_TU16BTMRL2_POSN                          0x2
#define _TU16BTMRL_TU16BTMRL2_POSITION                      0x2
#define _TU16BTMRL_TU16BTMRL2_SIZE                          0x1
#define _TU16BTMRL_TU16BTMRL2_LENGTH                        0x1
#define _TU16BTMRL_TU16BTMRL2_MASK                          0x4
#define _TU16BTMRL_TU16BTMRL3_POSN                          0x3
#define _TU16BTMRL_TU16BTMRL3_POSITION                      0x3
#define _TU16BTMRL_TU16BTMRL3_SIZE                          0x1
#define _TU16BTMRL_TU16BTMRL3_LENGTH                        0x1
#define _TU16BTMRL_TU16BTMRL3_MASK                          0x8
#define _TU16BTMRL_TU16BTMRL4_POSN                          0x4
#define _TU16BTMRL_TU16BTMRL4_POSITION                      0x4
#define _TU16BTMRL_TU16BTMRL4_SIZE                          0x1
#define _TU16BTMRL_TU16BTMRL4_LENGTH                        0x1
#define _TU16BTMRL_TU16BTMRL4_MASK                          0x10
#define _TU16BTMRL_TU16BTMRL5_POSN                          0x5
#define _TU16BTMRL_TU16BTMRL5_POSITION                      0x5
#define _TU16BTMRL_TU16BTMRL5_SIZE                          0x1
#define _TU16BTMRL_TU16BTMRL5_LENGTH                        0x1
#define _TU16BTMRL_TU16BTMRL5_MASK                          0x20
#define _TU16BTMRL_TU16BTMRL6_POSN                          0x6
#define _TU16BTMRL_TU16BTMRL6_POSITION                      0x6
#define _TU16BTMRL_TU16BTMRL6_SIZE                          0x1
#define _TU16BTMRL_TU16BTMRL6_LENGTH                        0x1
#define _TU16BTMRL_TU16BTMRL6_MASK                          0x40
#define _TU16BTMRL_TU16BTMRL7_POSN                          0x7
#define _TU16BTMRL_TU16BTMRL7_POSITION                      0x7
#define _TU16BTMRL_TU16BTMRL7_SIZE                          0x1
#define _TU16BTMRL_TU16BTMRL7_LENGTH                        0x1
#define _TU16BTMRL_TU16BTMRL7_MASK                          0x80
#define _TU16BTMRL_TU16BTMR0_POSN                           0x0
#define _TU16BTMRL_TU16BTMR0_POSITION                       0x0
#define _TU16BTMRL_TU16BTMR0_SIZE                           0x1
#define _TU16BTMRL_TU16BTMR0_LENGTH                         0x1
#define _TU16BTMRL_TU16BTMR0_MASK                           0x1
#define _TU16BTMRL_TU16BTMR1_POSN                           0x1
#define _TU16BTMRL_TU16BTMR1_POSITION                       0x1
#define _TU16BTMRL_TU16BTMR1_SIZE                           0x1
#define _TU16BTMRL_TU16BTMR1_LENGTH                         0x1
#define _TU16BTMRL_TU16BTMR1_MASK                           0x2
#define _TU16BTMRL_TU16BTMR2_POSN                           0x2
#define _TU16BTMRL_TU16BTMR2_POSITION                       0x2
#define _TU16BTMRL_TU16BTMR2_SIZE                           0x1
#define _TU16BTMRL_TU16BTMR2_LENGTH                         0x1
#define _TU16BTMRL_TU16BTMR2_MASK                           0x4
#define _TU16BTMRL_TU16BTMR3_POSN                           0x3
#define _TU16BTMRL_TU16BTMR3_POSITION                       0x3
#define _TU16BTMRL_TU16BTMR3_SIZE                           0x1
#define _TU16BTMRL_TU16BTMR3_LENGTH                         0x1
#define _TU16BTMRL_TU16BTMR3_MASK                           0x8
#define _TU16BTMRL_TU16BTMR4_POSN                           0x4
#define _TU16BTMRL_TU16BTMR4_POSITION                       0x4
#define _TU16BTMRL_TU16BTMR4_SIZE                           0x1
#define _TU16BTMRL_TU16BTMR4_LENGTH                         0x1
#define _TU16BTMRL_TU16BTMR4_MASK                           0x10
#define _TU16BTMRL_TU16BTMR5_POSN                           0x5
#define _TU16BTMRL_TU16BTMR5_POSITION                       0x5
#define _TU16BTMRL_TU16BTMR5_SIZE                           0x1
#define _TU16BTMRL_TU16BTMR5_LENGTH                         0x1
#define _TU16BTMRL_TU16BTMR5_MASK                           0x20
#define _TU16BTMRL_TU16BTMR6_POSN                           0x6
#define _TU16BTMRL_TU16BTMR6_POSITION                       0x6
#define _TU16BTMRL_TU16BTMR6_SIZE                           0x1
#define _TU16BTMRL_TU16BTMR6_LENGTH                         0x1
#define _TU16BTMRL_TU16BTMR6_MASK                           0x40
#define _TU16BTMRL_TU16BTMR7_POSN                           0x7
#define _TU16BTMRL_TU16BTMR7_POSITION                       0x7
#define _TU16BTMRL_TU16BTMR7_SIZE                           0x1
#define _TU16BTMRL_TU16BTMR7_LENGTH                         0x1
#define _TU16BTMRL_TU16BTMR7_MASK                           0x80

