GopalSaraf/Practicals/PSDL/include/proc/pic18f56q71.h
#define                                 ODCF0_bit           _BIT_ACCESS(ODCONF,0)
// ODCONF<ODCF1>
extern volatile __bit                   ODCF1               __at(0x2151);	// @ (0x42A * 8 + 1)
#define                                 ODCF1_bit           _BIT_ACCESS(ODCONF,1)
// ODCONF<ODCF2>
extern volatile __bit                   ODCF2               __at(0x2152);	// @ (0x42A * 8 + 2)
#define                                 ODCF2_bit           _BIT_ACCESS(ODCONF,2)
// ODCONF<ODCF3>
extern volatile __bit                   ODCF3               __at(0x2153);	// @ (0x42A * 8 + 3)
#define                                 ODCF3_bit           _BIT_ACCESS(ODCONF,3)
// ODCONF<ODCF4>
extern volatile __bit                   ODCF4               __at(0x2154);	// @ (0x42A * 8 + 4)
#define                                 ODCF4_bit           _BIT_ACCESS(ODCONF,4)
// ODCONF<ODCF5>
extern volatile __bit                   ODCF5               __at(0x2155);	// @ (0x42A * 8 + 5)
#define                                 ODCF5_bit           _BIT_ACCESS(ODCONF,5)
// ODCONF<ODCF6>
extern volatile __bit                   ODCF6               __at(0x2156);	// @ (0x42A * 8 + 6)
#define                                 ODCF6_bit           _BIT_ACCESS(ODCONF,6)
// ODCONF<ODCF7>
extern volatile __bit                   ODCF7               __at(0x2157);	// @ (0x42A * 8 + 7)
#define                                 ODCF7_bit           _BIT_ACCESS(ODCONF,7)
// OPA1CON0<OPA1CPON>
extern volatile __bit                   OPA1CPON            __at(0x8FD);	// @ (0x11F * 8 + 5)
#define                                 OPA1CPON_bit        _BIT_ACCESS(OPA1CON0,5)
// OPA1CON0<OPA1EN>
extern volatile __bit                   OPA1EN              __at(0x8FF);	// @ (0x11F * 8 + 7)
#define                                 OPA1EN_bit          _BIT_ACCESS(OPA1CON0,7)
// OPA1CON3<OPA1FMS0>
extern volatile __bit                   OPA1FMS0            __at(0x916);	// @ (0x122 * 8 + 6)
#define                                 OPA1FMS0_bit        _BIT_ACCESS(OPA1CON3,6)
// OPA1CON3<OPA1FMS1>
extern volatile __bit                   OPA1FMS1            __at(0x917);	// @ (0x122 * 8 + 7)
#define                                 OPA1FMS1_bit        _BIT_ACCESS(OPA1CON3,7)
// OPA1CON1<OPA1GSEL0>
extern volatile __bit                   OPA1GSEL0           __at(0x904);	// @ (0x120 * 8 + 4)
#define                                 OPA1GSEL0_bit       _BIT_ACCESS(OPA1CON1,4)
// OPA1CON1<OPA1GSEL1>
extern volatile __bit                   OPA1GSEL1           __at(0x905);	// @ (0x120 * 8 + 5)
#define                                 OPA1GSEL1_bit       _BIT_ACCESS(OPA1CON1,5)
// OPA1CON1<OPA1GSEL2>
extern volatile __bit                   OPA1GSEL2           __at(0x906);	// @ (0x120 * 8 + 6)
#define                                 OPA1GSEL2_bit       _BIT_ACCESS(OPA1CON1,6)
// OPA1HWC<OPA1HWCH0>
extern volatile __bit                   OPA1HWCH0           __at(0x924);	// @ (0x124 * 8 + 4)
#define                                 OPA1HWCH0_bit       _BIT_ACCESS(OPA1HWC,4)
// OPA1HWC<OPA1HWCH1>
extern volatile __bit                   OPA1HWCH1           __at(0x925);	// @ (0x124 * 8 + 5)
#define                                 OPA1HWCH1_bit       _BIT_ACCESS(OPA1HWC,5)
// OPA1HWC<OPA1HWCH2>
extern volatile __bit                   OPA1HWCH2           __at(0x926);	// @ (0x124 * 8 + 6)
#define                                 OPA1HWCH2_bit       _BIT_ACCESS(OPA1HWC,6)
// OPA1HWC<OPA1HWCL0>
extern volatile __bit                   OPA1HWCL0           __at(0x920);	// @ (0x124 * 8 + 0)
#define                                 OPA1HWCL0_bit       _BIT_ACCESS(OPA1HWC,0)
// OPA1HWC<OPA1HWCL1>
extern volatile __bit                   OPA1HWCL1           __at(0x921);	// @ (0x124 * 8 + 1)
#define                                 OPA1HWCL1_bit       _BIT_ACCESS(OPA1HWC,1)
// OPA1HWC<OPA1HWCL2>
extern volatile __bit                   OPA1HWCL2           __at(0x922);	// @ (0x124 * 8 + 2)
#define                                 OPA1HWCL2_bit       _BIT_ACCESS(OPA1HWC,2)
// OPA1CON3<OPA1INTOE>
extern volatile __bit                   OPA1INTOE           __at(0x915);	// @ (0x122 * 8 + 5)
#define                                 OPA1INTOE_bit       _BIT_ACCESS(OPA1CON3,5)
// PMD5<OPA1MD>
extern volatile __bit                   OPA1MD              __at(0x33A);	// @ (0x67 * 8 + 2)
#define                                 OPA1MD_bit          _BIT_ACCESS(PMD5,2)
// OPA1CON2<OPA1NCH0>
extern volatile __bit                   OPA1NCH0            __at(0x90C);	// @ (0x121 * 8 + 4)
#define                                 OPA1NCH0_bit        _BIT_ACCESS(OPA1CON2,4)
// OPA1CON2<OPA1NCH1>
extern volatile __bit                   OPA1NCH1            __at(0x90D);	// @ (0x121 * 8 + 5)
#define                                 OPA1NCH1_bit        _BIT_ACCESS(OPA1CON2,5)
// OPA1CON2<OPA1NCH2>
extern volatile __bit                   OPA1NCH2            __at(0x90E);	// @ (0x121 * 8 + 6)
#define                                 OPA1NCH2_bit        _BIT_ACCESS(OPA1CON2,6)
// OPA1CON1<OPA1NSS0>
extern volatile __bit                   OPA1NSS0            __at(0x900);	// @ (0x120 * 8 + 0)
#define                                 OPA1NSS0_bit        _BIT_ACCESS(OPA1CON1,0)
// OPA1CON1<OPA1NSS1>
extern volatile __bit                   OPA1NSS1            __at(0x901);	// @ (0x120 * 8 + 1)
#define                                 OPA1NSS1_bit        _BIT_ACCESS(OPA1CON1,1)
// OPA1CON1<OPA1NSS2>
extern volatile __bit                   OPA1NSS2            __at(0x902);	// @ (0x120 * 8 + 2)
#define                                 OPA1NSS2_bit        _BIT_ACCESS(OPA1CON1,2)
// OPA1CON4<OPA1OFCSEL0>
extern volatile __bit                   OPA1OFCSEL0         __at(0x918);	// @ (0x123 * 8 + 0)
#define                                 OPA1OFCSEL0_bit     _BIT_ACCESS(OPA1CON4,0)
// OPA1CON4<OPA1OFCSEL1>
extern volatile __bit                   OPA1OFCSEL1         __at(0x919);	// @ (0x123 * 8 + 1)
#define                                 OPA1OFCSEL1_bit     _BIT_ACCESS(OPA1CON4,1)
// OPA1CON4<OPA1OFCST>
extern volatile __bit                   OPA1OFCST           __at(0x91A);	// @ (0x123 * 8 + 2)
#define                                 OPA1OFCST_bit       _BIT_ACCESS(OPA1CON4,2)
// OPA1OFFSET<OPA1OFFSET0>
extern volatile __bit                   OPA1OFFSET0         __at(0x928);	// @ (0x125 * 8 + 0)
#define                                 OPA1OFFSET0_bit     _BIT_ACCESS(OPA1OFFSET,0)
// OPA1OFFSET<OPA1OFFSET1>
extern volatile __bit                   OPA1OFFSET1         __at(0x929);	// @ (0x125 * 8 + 1)
#define                                 OPA1OFFSET1_bit     _BIT_ACCESS(OPA1OFFSET,1)
// OPA1OFFSET<OPA1OFFSET2>
extern volatile __bit                   OPA1OFFSET2         __at(0x92A);	// @ (0x125 * 8 + 2)
#define                                 OPA1OFFSET2_bit     _BIT_ACCESS(OPA1OFFSET,2)
// OPA1OFFSET<OPA1OFFSET3>
extern volatile __bit                   OPA1OFFSET3         __at(0x92B);	// @ (0x125 * 8 + 3)
#define                                 OPA1OFFSET3_bit     _BIT_ACCESS(OPA1OFFSET,3)
// OPA1OFFSET<OPA1OFFSET4>
extern volatile __bit                   OPA1OFFSET4         __at(0x92C);	// @ (0x125 * 8 + 4)
#define                                 OPA1OFFSET4_bit     _BIT_ACCESS(OPA1OFFSET,4)
// OPA1OFFSET<OPA1OFFSET5>
extern volatile __bit                   OPA1OFFSET5         __at(0x92D);	// @ (0x125 * 8 + 5)
#define                                 OPA1OFFSET5_bit     _BIT_ACCESS(OPA1OFFSET,5)
// OPA1OFFSET<OPA1OFFSET6>
extern volatile __bit                   OPA1OFFSET6         __at(0x92E);	// @ (0x125 * 8 + 6)
#define                                 OPA1OFFSET6_bit     _BIT_ACCESS(OPA1OFFSET,6)
// OPA1OFFSET<OPA1OFFSET7>
extern volatile __bit                   OPA1OFFSET7         __at(0x92F);	// @ (0x125 * 8 + 7)
#define                                 OPA1OFFSET7_bit     _BIT_ACCESS(OPA1OFFSET,7)
// OPA1HWC<OPA1OREN>
extern volatile __bit                   OPA1OREN            __at(0x927);	// @ (0x124 * 8 + 7)
#define                                 OPA1OREN_bit        _BIT_ACCESS(OPA1HWC,7)
// OPA1HWC<OPA1ORPOL>
extern volatile __bit                   OPA1ORPOL           __at(0x923);	// @ (0x124 * 8 + 3)
#define                                 OPA1ORPOL_bit       _BIT_ACCESS(OPA1HWC,3)
// OPA1ORS<OPA1ORS0>
extern volatile __bit                   OPA1ORS0            __at(0x930);	// @ (0x126 * 8 + 0)
#define                                 OPA1ORS0_bit        _BIT_ACCESS(OPA1ORS,0)
// OPA1ORS<OPA1ORS1>
extern volatile __bit                   OPA1ORS1            __at(0x931);	// @ (0x126 * 8 + 1)
#define                                 OPA1ORS1_bit        _BIT_ACCESS(OPA1ORS,1)
// OPA1ORS<OPA1ORS2>
extern volatile __bit                   OPA1ORS2            __at(0x932);	// @ (0x126 * 8 + 2)
#define                                 OPA1ORS2_bit        _BIT_ACCESS(OPA1ORS,2)
// OPA1ORS<OPA1ORS3>
extern volatile __bit                   OPA1ORS3            __at(0x933);	// @ (0x126 * 8 + 3)
#define                                 OPA1ORS3_bit        _BIT_ACCESS(OPA1ORS,3)
// OPA1ORS<OPA1ORS4>
extern volatile __bit                   OPA1ORS4            __at(0x934);	// @ (0x126 * 8 + 4)
#define                                 OPA1ORS4_bit        _BIT_ACCESS(OPA1ORS,4)
// OPA1ORS<OPA1ORS5>
extern volatile __bit                   OPA1ORS5            __at(0x935);	// @ (0x126 * 8 + 5)
#define                                 OPA1ORS5_bit        _BIT_ACCESS(OPA1ORS,5)
// OPA1ORS<OPA1ORS6>
extern volatile __bit                   OPA1ORS6            __at(0x936);	// @ (0x126 * 8 + 6)
#define                                 OPA1ORS6_bit        _BIT_ACCESS(OPA1ORS,6)
// OPA1ORS<OPA1ORS7>
extern volatile __bit                   OPA1ORS7            __at(0x937);	// @ (0x126 * 8 + 7)
#define                                 OPA1ORS7_bit        _BIT_ACCESS(OPA1ORS,7)
// OPA1CON2<OPA1PCH0>
extern volatile __bit                   OPA1PCH0            __at(0x908);	// @ (0x121 * 8 + 0)
#define                                 OPA1PCH0_bit        _BIT_ACCESS(OPA1CON2,0)
// OPA1CON2<OPA1PCH1>
extern volatile __bit                   OPA1PCH1            __at(0x909);	// @ (0x121 * 8 + 1)
#define                                 OPA1PCH1_bit        _BIT_ACCESS(OPA1CON2,1)
// OPA1CON2<OPA1PCH2>
extern volatile __bit                   OPA1PCH2            __at(0x90A);	// @ (0x121 * 8 + 2)
#define                                 OPA1PCH2_bit        _BIT_ACCESS(OPA1CON2,2)
// OPA1ORPPS<OPA1PPS0>
extern volatile __bit                   OPA1PPS0            __at(0x13B0);	// @ (0x276 * 8 + 0)
#define                                 OPA1PPS0_bit        _BIT_ACCESS(OPA1ORPPS,0)
// OPA1ORPPS<OPA1PPS1>
extern volatile __bit                   OPA1PPS1            __at(0x13B1);	// @ (0x276 * 8 + 1)
#define                                 OPA1PPS1_bit        _BIT_ACCESS(OPA1ORPPS,1)
// OPA1ORPPS<OPA1PPS2>
extern volatile __bit                   OPA1PPS2            __at(0x13B2);	// @ (0x276 * 8 + 2)
#define                                 OPA1PPS2_bit        _BIT_ACCESS(OPA1ORPPS,2)
// OPA1ORPPS<OPA1PPS3>
extern volatile __bit                   OPA1PPS3            __at(0x13B3);	// @ (0x276 * 8 + 3)
#define                                 OPA1PPS3_bit        _BIT_ACCESS(OPA1ORPPS,3)
// OPA1ORPPS<OPA1PPS4>
extern volatile __bit                   OPA1PPS4            __at(0x13B4);	// @ (0x276 * 8 + 4)
#define                                 OPA1PPS4_bit        _BIT_ACCESS(OPA1ORPPS,4)
// OPA1ORPPS<OPA1PPS5>
extern volatile __bit                   OPA1PPS5            __at(0x13B5);	// @ (0x276 * 8 + 5)
#define                                 OPA1PPS5_bit        _BIT_ACCESS(OPA1ORPPS,5)
// OPA1CON3<OPA1PSS0>
extern volatile __bit                   OPA1PSS0            __at(0x910);	// @ (0x122 * 8 + 0)
#define                                 OPA1PSS0_bit        _BIT_ACCESS(OPA1CON3,0)
// OPA1CON3<OPA1PSS1>
extern volatile __bit                   OPA1PSS1            __at(0x911);	// @ (0x122 * 8 + 1)
#define                                 OPA1PSS1_bit        _BIT_ACCESS(OPA1CON3,1)
// OPA1CON3<OPA1PSS2>
extern volatile __bit                   OPA1PSS2            __at(0x912);	// @ (0x122 * 8 + 2)
#define                                 OPA1PSS2_bit        _BIT_ACCESS(OPA1CON3,2)
// OPA1CON3<OPA1PSS3>
extern volatile __bit                   OPA1PSS3            __at(0x913);	// @ (0x122 * 8 + 3)
#define                                 OPA1PSS3_bit        _BIT_ACCESS(OPA1CON3,3)
// OPA1CON3<OPA1PSS4>
extern volatile __bit                   OPA1PSS4            __at(0x914);	// @ (0x122 * 8 + 4)
#define                                 OPA1PSS4_bit        _BIT_ACCESS(OPA1CON3,4)
// OPA1CON4<OPA1PTRES>
extern volatile __bit                   OPA1PTRES           __at(0x91C);	// @ (0x123 * 8 + 4)
#define                                 OPA1PTRES_bit       _BIT_ACCESS(OPA1CON4,4)
// OPA1CON1<OPA1RESON>
extern volatile __bit                   OPA1RESON           __at(0x903);	// @ (0x120 * 8 + 3)
#define                                 OPA1RESON_bit       _BIT_ACCESS(OPA1CON1,3)
// OPA1CON0<OPA1UG>
extern volatile __bit                   OPA1UG              __at(0x8FB);	// @ (0x11F * 8 + 3)
#define                                 OPA1UG_bit          _BIT_ACCESS(OPA1CON0,3)
// OPA2CON0<OPA2CPON>
extern volatile __bit                   OPA2CPON            __at(0x93D);	// @ (0x127 * 8 + 5)
#define                                 OPA2CPON_bit        _BIT_ACCESS(OPA2CON0,5)
// OPA2CON0<OPA2EN>
extern volatile __bit                   OPA2EN              __at(0x93F);	// @ (0x127 * 8 + 7)
#define                                 OPA2EN_bit          _BIT_ACCESS(OPA2CON0,7)
// OPA2CON3<OPA2FMS0>
extern volatile __bit                   OPA2FMS0            __at(0x956);	// @ (0x12A * 8 + 6)
#define                                 OPA2FMS0_bit        _BIT_ACCESS(OPA2CON3,6)
// OPA2CON3<OPA2FMS1>
extern volatile __bit                   OPA2FMS1            __at(0x957);	// @ (0x12A * 8 + 7)
#define                                 OPA2FMS1_bit        _BIT_ACCESS(OPA2CON3,7)
// OPA2CON1<OPA2GSEL0>
extern volatile __bit                   OPA2GSEL0           __at(0x944);	// @ (0x128 * 8 + 4)
#define                                 OPA2GSEL0_bit       _BIT_ACCESS(OPA2CON1,4)
// OPA2CON1<OPA2GSEL1>
extern volatile __bit                   OPA2GSEL1           __at(0x945);	// @ (0x128 * 8 + 5)
#define                                 OPA2GSEL1_bit       _BIT_ACCESS(OPA2CON1,5)
// OPA2CON1<OPA2GSEL2>
extern volatile __bit                   OPA2GSEL2           __at(0x946);	// @ (0x128 * 8 + 6)
#define                                 OPA2GSEL2_bit       _BIT_ACCESS(OPA2CON1,6)
// OPA2HWC<OPA2HWCH0>
extern volatile __bit                   OPA2HWCH0           __at(0x964);	// @ (0x12C * 8 + 4)
#define                                 OPA2HWCH0_bit       _BIT_ACCESS(OPA2HWC,4)
// OPA2HWC<OPA2HWCH1>
extern volatile __bit                   OPA2HWCH1           __at(0x965);	// @ (0x12C * 8 + 5)
#define                                 OPA2HWCH1_bit       _BIT_ACCESS(OPA2HWC,5)
// OPA2HWC<OPA2HWCH2>
extern volatile __bit                   OPA2HWCH2           __at(0x966);	// @ (0x12C * 8 + 6)
#define                                 OPA2HWCH2_bit       _BIT_ACCESS(OPA2HWC,6)
// OPA2HWC<OPA2HWCL0>
extern volatile __bit                   OPA2HWCL0           __at(0x960);	// @ (0x12C * 8 + 0)
#define                                 OPA2HWCL0_bit       _BIT_ACCESS(OPA2HWC,0)
// OPA2HWC<OPA2HWCL1>
extern volatile __bit                   OPA2HWCL1           __at(0x961);	// @ (0x12C * 8 + 1)
#define                                 OPA2HWCL1_bit       _BIT_ACCESS(OPA2HWC,1)
// OPA2HWC<OPA2HWCL2>
extern volatile __bit                   OPA2HWCL2           __at(0x962);	// @ (0x12C * 8 + 2)
#define                                 OPA2HWCL2_bit       _BIT_ACCESS(OPA2HWC,2)
// OPA2CON3<OPA2INTOE>
extern volatile __bit                   OPA2INTOE           __at(0x955);	// @ (0x12A * 8 + 5)
#define                                 OPA2INTOE_bit       _BIT_ACCESS(OPA2CON3,5)
// PMD5<OPA2MD>
extern volatile __bit                   OPA2MD              __at(0x33B);	// @ (0x67 * 8 + 3)
#define                                 OPA2MD_bit          _BIT_ACCESS(PMD5,3)
// OPA2CON2<OPA2NCH0>
extern volatile __bit                   OPA2NCH0            __at(0x94C);	// @ (0x129 * 8 + 4)
#define                                 OPA2NCH0_bit        _BIT_ACCESS(OPA2CON2,4)
// OPA2CON2<OPA2NCH1>
extern volatile __bit                   OPA2NCH1            __at(0x94D);	// @ (0x129 * 8 + 5)
#define                                 OPA2NCH1_bit        _BIT_ACCESS(OPA2CON2,5)
// OPA2CON2<OPA2NCH2>
extern volatile __bit                   OPA2NCH2            __at(0x94E);	// @ (0x129 * 8 + 6)
#define                                 OPA2NCH2_bit        _BIT_ACCESS(OPA2CON2,6)
// OPA2CON1<OPA2NSS0>
extern volatile __bit                   OPA2NSS0            __at(0x940);	// @ (0x128 * 8 + 0)
#define                                 OPA2NSS0_bit        _BIT_ACCESS(OPA2CON1,0)
// OPA2CON1<OPA2NSS1>
extern volatile __bit                   OPA2NSS1            __at(0x941);	// @ (0x128 * 8 + 1)
#define                                 OPA2NSS1_bit        _BIT_ACCESS(OPA2CON1,1)
// OPA2CON1<OPA2NSS2>
extern volatile __bit                   OPA2NSS2            __at(0x942);	// @ (0x128 * 8 + 2)
#define                                 OPA2NSS2_bit        _BIT_ACCESS(OPA2CON1,2)
// OPA2CON4<OPA2OFCSEL0>
extern volatile __bit                   OPA2OFCSEL0         __at(0x958);	// @ (0x12B * 8 + 0)
#define                                 OPA2OFCSEL0_bit     _BIT_ACCESS(OPA2CON4,0)
// OPA2CON4<OPA2OFCSEL1>
extern volatile __bit                   OPA2OFCSEL1         __at(0x959);	// @ (0x12B * 8 + 1)
#define                                 OPA2OFCSEL1_bit     _BIT_ACCESS(OPA2CON4,1)
// OPA2CON4<OPA2OFCST>
extern volatile __bit                   OPA2OFCST           __at(0x95A);	// @ (0x12B * 8 + 2)
#define                                 OPA2OFCST_bit       _BIT_ACCESS(OPA2CON4,2)
// OPA2OFFSET<OPA2OFFSET0>
extern volatile __bit                   OPA2OFFSET0         __at(0x968);	// @ (0x12D * 8 + 0)
#define                                 OPA2OFFSET0_bit     _BIT_ACCESS(OPA2OFFSET,0)
// OPA2OFFSET<OPA2OFFSET1>
extern volatile __bit                   OPA2OFFSET1         __at(0x969);	// @ (0x12D * 8 + 1)
#define                                 OPA2OFFSET1_bit     _BIT_ACCESS(OPA2OFFSET,1)
// OPA2OFFSET<OPA2OFFSET2>
extern volatile __bit                   OPA2OFFSET2         __at(0x96A);	// @ (0x12D * 8 + 2)
#define                                 OPA2OFFSET2_bit     _BIT_ACCESS(OPA2OFFSET,2)
// OPA2OFFSET<OPA2OFFSET3>
extern volatile __bit                   OPA2OFFSET3         __at(0x96B);	// @ (0x12D * 8 + 3)
#define                                 OPA2OFFSET3_bit     _BIT_ACCESS(OPA2OFFSET,3)
// OPA2OFFSET<OPA2OFFSET4>
extern volatile __bit                   OPA2OFFSET4         __at(0x96C);	// @ (0x12D * 8 + 4)
#define                                 OPA2OFFSET4_bit     _BIT_ACCESS(OPA2OFFSET,4)
// OPA2OFFSET<OPA2OFFSET5>
extern volatile __bit                   OPA2OFFSET5         __at(0x96D);	// @ (0x12D * 8 + 5)
#define                                 OPA2OFFSET5_bit     _BIT_ACCESS(OPA2OFFSET,5)
// OPA2OFFSET<OPA2OFFSET6>
extern volatile __bit                   OPA2OFFSET6         __at(0x96E);	// @ (0x12D * 8 + 6)
#define                                 OPA2OFFSET6_bit     _BIT_ACCESS(OPA2OFFSET,6)
// OPA2OFFSET<OPA2OFFSET7>
extern volatile __bit                   OPA2OFFSET7         __at(0x96F);	// @ (0x12D * 8 + 7)
#define                                 OPA2OFFSET7_bit     _BIT_ACCESS(OPA2OFFSET,7)
// OPA2HWC<OPA2OREN>
extern volatile __bit                   OPA2OREN            __at(0x967);	// @ (0x12C * 8 + 7)
#define                                 OPA2OREN_bit        _BIT_ACCESS(OPA2HWC,7)
// OPA2HWC<OPA2ORPOL>
extern volatile __bit                   OPA2ORPOL           __at(0x963);	// @ (0x12C * 8 + 3)
#define                                 OPA2ORPOL_bit       _BIT_ACCESS(OPA2HWC,3)
// OPA2ORS<OPA2ORS0>
extern volatile __bit                   OPA2ORS0            __at(0x970);	// @ (0x12E * 8 + 0)
#define                                 OPA2ORS0_bit        _BIT_ACCESS(OPA2ORS,0)
// OPA2ORS<OPA2ORS1>
extern volatile __bit                   OPA2ORS1            __at(0x971);	// @ (0x12E * 8 + 1)
#define                                 OPA2ORS1_bit        _BIT_ACCESS(OPA2ORS,1)
// OPA2ORS<OPA2ORS2>
extern volatile __bit                   OPA2ORS2            __at(0x972);	// @ (0x12E * 8 + 2)
#define                                 OPA2ORS2_bit        _BIT_ACCESS(OPA2ORS,2)
// OPA2ORS<OPA2ORS3>
extern volatile __bit                   OPA2ORS3            __at(0x973);	// @ (0x12E * 8 + 3)
#define                                 OPA2ORS3_bit        _BIT_ACCESS(OPA2ORS,3)
// OPA2ORS<OPA2ORS4>
extern volatile __bit                   OPA2ORS4            __at(0x974);	// @ (0x12E * 8 + 4)
#define                                 OPA2ORS4_bit        _BIT_ACCESS(OPA2ORS,4)
// OPA2CON2<OPA2PCH0>
extern volatile __bit                   OPA2PCH0            __at(0x948);	// @ (0x129 * 8 + 0)
#define                                 OPA2PCH0_bit        _BIT_ACCESS(OPA2CON2,0)
// OPA2CON2<OPA2PCH1>
extern volatile __bit                   OPA2PCH1            __at(0x949);	// @ (0x129 * 8 + 1)
#define                                 OPA2PCH1_bit        _BIT_ACCESS(OPA2CON2,1)
// OPA2CON2<OPA2PCH2>
extern volatile __bit                   OPA2PCH2            __at(0x94A);	// @ (0x129 * 8 + 2)
#define                                 OPA2PCH2_bit        _BIT_ACCESS(OPA2CON2,2)
// OPA2ORPPS<OPA2PPS0>
extern volatile __bit                   OPA2PPS0            __at(0x13B8);	// @ (0x277 * 8 + 0)
#define                                 OPA2PPS0_bit        _BIT_ACCESS(OPA2ORPPS,0)
// OPA2ORPPS<OPA2PPS1>
extern volatile __bit                   OPA2PPS1            __at(0x13B9);	// @ (0x277 * 8 + 1)
#define                                 OPA2PPS1_bit        _BIT_ACCESS(OPA2ORPPS,1)
// OPA2ORPPS<OPA2PPS2>
extern volatile __bit                   OPA2PPS2            __at(0x13BA);	// @ (0x277 * 8 + 2)
#define                                 OPA2PPS2_bit        _BIT_ACCESS(OPA2ORPPS,2)
// OPA2ORPPS<OPA2PPS3>
extern volatile __bit                   OPA2PPS3            __at(0x13BB);	// @ (0x277 * 8 + 3)
#define                                 OPA2PPS3_bit        _BIT_ACCESS(OPA2ORPPS,3)
// OPA2ORPPS<OPA2PPS4>
extern volatile __bit                   OPA2PPS4            __at(0x13BC);	// @ (0x277 * 8 + 4)
#define                                 OPA2PPS4_bit        _BIT_ACCESS(OPA2ORPPS,4)
// OPA2ORPPS<OPA2PPS5>
extern volatile __bit                   OPA2PPS5            __at(0x13BD);	// @ (0x277 * 8 + 5)
#define                                 OPA2PPS5_bit        _BIT_ACCESS(OPA2ORPPS,5)
// OPA2CON3<OPA2PSS0>
extern volatile __bit                   OPA2PSS0            __at(0x950);	// @ (0x12A * 8 + 0)
#define                                 OPA2PSS0_bit        _BIT_ACCESS(OPA2CON3,0)
// OPA2CON3<OPA2PSS1>
extern volatile __bit                   OPA2PSS1            __at(0x951);	// @ (0x12A * 8 + 1)
#define                                 OPA2PSS1_bit        _BIT_ACCESS(OPA2CON3,1)
// OPA2CON4<OPA2PTRES>
extern volatile __bit                   OPA2PTRES           __at(0x95C);	// @ (0x12B * 8 + 4)
#define                                 OPA2PTRES_bit       _BIT_ACCESS(OPA2CON4,4)
// OPA2CON1<OPA2RESON>
extern volatile __bit                   OPA2RESON           __at(0x943);	// @ (0x128 * 8 + 3)
#define                                 OPA2RESON_bit       _BIT_ACCESS(OPA2CON1,3)
// OPA2CON0<OPA2UG>
extern volatile __bit                   OPA2UG              __at(0x93B);	// @ (0x127 * 8 + 3)
#define                                 OPA2UG_bit          _BIT_ACCESS(OPA2CON0,3)
// OSCCON3<ORDY>
