GopalSaraf/Practicals/PSDL/include/proc/pic18f56q71.h
#define                                 RF4PPS3_bit         _BIT_ACCESS(RF4PPS,3)
// RF4PPS<RF4PPS4>
extern volatile __bit                   RF4PPS4             __at(0x114C);	// @ (0x229 * 8 + 4)
#define                                 RF4PPS4_bit         _BIT_ACCESS(RF4PPS,4)
// RF4PPS<RF4PPS5>
extern volatile __bit                   RF4PPS5             __at(0x114D);	// @ (0x229 * 8 + 5)
#define                                 RF4PPS5_bit         _BIT_ACCESS(RF4PPS,5)
// PORTF<RF5>
extern volatile __bit                   RF5                 __at(0xAAD);	// @ (0x155 * 8 + 5)
#define                                 RF5_bit             _BIT_ACCESS(PORTF,5)
// RF5PPS<RF5PPS0>
extern volatile __bit                   RF5PPS0             __at(0x1150);	// @ (0x22A * 8 + 0)
#define                                 RF5PPS0_bit         _BIT_ACCESS(RF5PPS,0)
// RF5PPS<RF5PPS1>
extern volatile __bit                   RF5PPS1             __at(0x1151);	// @ (0x22A * 8 + 1)
#define                                 RF5PPS1_bit         _BIT_ACCESS(RF5PPS,1)
// RF5PPS<RF5PPS2>
extern volatile __bit                   RF5PPS2             __at(0x1152);	// @ (0x22A * 8 + 2)
#define                                 RF5PPS2_bit         _BIT_ACCESS(RF5PPS,2)
// RF5PPS<RF5PPS3>
extern volatile __bit                   RF5PPS3             __at(0x1153);	// @ (0x22A * 8 + 3)
#define                                 RF5PPS3_bit         _BIT_ACCESS(RF5PPS,3)
// RF5PPS<RF5PPS4>
extern volatile __bit                   RF5PPS4             __at(0x1154);	// @ (0x22A * 8 + 4)
#define                                 RF5PPS4_bit         _BIT_ACCESS(RF5PPS,4)
// RF5PPS<RF5PPS5>
extern volatile __bit                   RF5PPS5             __at(0x1155);	// @ (0x22A * 8 + 5)
#define                                 RF5PPS5_bit         _BIT_ACCESS(RF5PPS,5)
// PORTF<RF6>
extern volatile __bit                   RF6                 __at(0xAAE);	// @ (0x155 * 8 + 6)
#define                                 RF6_bit             _BIT_ACCESS(PORTF,6)
// RF6PPS<RF6PPS0>
extern volatile __bit                   RF6PPS0             __at(0x1158);	// @ (0x22B * 8 + 0)
#define                                 RF6PPS0_bit         _BIT_ACCESS(RF6PPS,0)
// RF6PPS<RF6PPS1>
extern volatile __bit                   RF6PPS1             __at(0x1159);	// @ (0x22B * 8 + 1)
#define                                 RF6PPS1_bit         _BIT_ACCESS(RF6PPS,1)
// RF6PPS<RF6PPS2>
extern volatile __bit                   RF6PPS2             __at(0x115A);	// @ (0x22B * 8 + 2)
#define                                 RF6PPS2_bit         _BIT_ACCESS(RF6PPS,2)
// RF6PPS<RF6PPS3>
extern volatile __bit                   RF6PPS3             __at(0x115B);	// @ (0x22B * 8 + 3)
#define                                 RF6PPS3_bit         _BIT_ACCESS(RF6PPS,3)
// RF6PPS<RF6PPS4>
extern volatile __bit                   RF6PPS4             __at(0x115C);	// @ (0x22B * 8 + 4)
#define                                 RF6PPS4_bit         _BIT_ACCESS(RF6PPS,4)
// RF6PPS<RF6PPS5>
extern volatile __bit                   RF6PPS5             __at(0x115D);	// @ (0x22B * 8 + 5)
#define                                 RF6PPS5_bit         _BIT_ACCESS(RF6PPS,5)
// PORTF<RF7>
extern volatile __bit                   RF7                 __at(0xAAF);	// @ (0x155 * 8 + 7)
#define                                 RF7_bit             _BIT_ACCESS(PORTF,7)
// RF7PPS<RF7PPS0>
extern volatile __bit                   RF7PPS0             __at(0x1160);	// @ (0x22C * 8 + 0)
#define                                 RF7PPS0_bit         _BIT_ACCESS(RF7PPS,0)
// RF7PPS<RF7PPS1>
extern volatile __bit                   RF7PPS1             __at(0x1161);	// @ (0x22C * 8 + 1)
#define                                 RF7PPS1_bit         _BIT_ACCESS(RF7PPS,1)
// RF7PPS<RF7PPS2>
extern volatile __bit                   RF7PPS2             __at(0x1162);	// @ (0x22C * 8 + 2)
#define                                 RF7PPS2_bit         _BIT_ACCESS(RF7PPS,2)
// RF7PPS<RF7PPS3>
extern volatile __bit                   RF7PPS3             __at(0x1163);	// @ (0x22C * 8 + 3)
#define                                 RF7PPS3_bit         _BIT_ACCESS(RF7PPS,3)
// RF7PPS<RF7PPS4>
extern volatile __bit                   RF7PPS4             __at(0x1164);	// @ (0x22C * 8 + 4)
#define                                 RF7PPS4_bit         _BIT_ACCESS(RF7PPS,4)
// RF7PPS<RF7PPS5>
extern volatile __bit                   RF7PPS5             __at(0x1165);	// @ (0x22C * 8 + 5)
#define                                 RF7PPS5_bit         _BIT_ACCESS(RF7PPS,5)
// PCON0<RI>
extern volatile __bit                   RI                  __at(0x2782);	// @ (0x4F0 * 8 + 2)
#define                                 RI_bit              _BIT_ACCESS(PCON0,2)
// PCON0<RMCLR>
extern volatile __bit                   RMCLR               __at(0x2783);	// @ (0x4F0 * 8 + 3)
#define                                 RMCLR_bit           _BIT_ACCESS(PCON0,3)
// CPUDOZE<ROI>
extern volatile __bit                   ROI                 __at(0x2795);	// @ (0x4F2 * 8 + 5)
#define                                 ROI_bit             _BIT_ACCESS(CPUDOZE,5)
// ADRPT<RPT0>
extern volatile __bit                   RPT0                __at(0x1F38);	// @ (0x3E7 * 8 + 0)
#define                                 RPT0_bit            _BIT_ACCESS(ADRPT,0)
// ADRPT<RPT1>
extern volatile __bit                   RPT1                __at(0x1F39);	// @ (0x3E7 * 8 + 1)
#define                                 RPT1_bit            _BIT_ACCESS(ADRPT,1)
// ADRPT<RPT2>
extern volatile __bit                   RPT2                __at(0x1F3A);	// @ (0x3E7 * 8 + 2)
#define                                 RPT2_bit            _BIT_ACCESS(ADRPT,2)
// ADRPT<RPT3>
extern volatile __bit                   RPT3                __at(0x1F3B);	// @ (0x3E7 * 8 + 3)
#define                                 RPT3_bit            _BIT_ACCESS(ADRPT,3)
// ADRPT<RPT4>
extern volatile __bit                   RPT4                __at(0x1F3C);	// @ (0x3E7 * 8 + 4)
#define                                 RPT4_bit            _BIT_ACCESS(ADRPT,4)
// ADRPT<RPT5>
extern volatile __bit                   RPT5                __at(0x1F3D);	// @ (0x3E7 * 8 + 5)
#define                                 RPT5_bit            _BIT_ACCESS(ADRPT,5)
// ADRPT<RPT6>
extern volatile __bit                   RPT6                __at(0x1F3E);	// @ (0x3E7 * 8 + 6)
#define                                 RPT6_bit            _BIT_ACCESS(ADRPT,6)
// ADRPT<RPT7>
extern volatile __bit                   RPT7                __at(0x1F3F);	// @ (0x3E7 * 8 + 7)
#define                                 RPT7_bit            _BIT_ACCESS(ADRPT,7)
// I2C1PIE<RSC1IE>
extern volatile __bit                   RSC1IE              __at(0x14D9);	// @ (0x29B * 8 + 1)
#define                                 RSC1IE_bit          _BIT_ACCESS(I2C1PIE,1)
// I2C1PIR<RSC1IF>
extern volatile __bit                   RSC1IF              __at(0x14D1);	// @ (0x29A * 8 + 1)
#define                                 RSC1IF_bit          _BIT_ACCESS(I2C1PIR,1)
// I2C1PIE<RSCIE>
extern volatile __bit                   RSCIE               __at(0x14D9);	// @ (0x29B * 8 + 1)
#define                                 RSCIE_bit           _BIT_ACCESS(I2C1PIE,1)
// I2C1PIR<RSCIF>
extern volatile __bit                   RSCIF               __at(0x14D1);	// @ (0x29A * 8 + 1)
#define                                 RSCIF_bit           _BIT_ACCESS(I2C1PIR,1)
// I2C1CON0<RSEN>
extern volatile __bit                   RSEN                __at(0x149E);	// @ (0x293 * 8 + 6)
#define                                 RSEN_bit            _BIT_ACCESS(I2C1CON0,6)
// PORTW<RW0>
extern volatile __bit                   RW0                 __at(0x800);	// @ (0x100 * 8 + 0)
#define                                 RW0_bit             _BIT_ACCESS(PORTW,0)
// PORTW<RW1>
extern volatile __bit                   RW1                 __at(0x801);	// @ (0x100 * 8 + 1)
#define                                 RW1_bit             _BIT_ACCESS(PORTW,1)
// PORTW<RW2>
extern volatile __bit                   RW2                 __at(0x802);	// @ (0x100 * 8 + 2)
#define                                 RW2_bit             _BIT_ACCESS(PORTW,2)
// PORTW<RW3>
extern volatile __bit                   RW3                 __at(0x803);	// @ (0x100 * 8 + 3)
#define                                 RW3_bit             _BIT_ACCESS(PORTW,3)
// PORTW<RW4>
extern volatile __bit                   RW4                 __at(0x804);	// @ (0x100 * 8 + 4)
#define                                 RW4_bit             _BIT_ACCESS(PORTW,4)
// PORTW<RW5>
extern volatile __bit                   RW5                 __at(0x805);	// @ (0x100 * 8 + 5)
#define                                 RW5_bit             _BIT_ACCESS(PORTW,5)
// PORTW<RW6>
extern volatile __bit                   RW6                 __at(0x806);	// @ (0x100 * 8 + 6)
#define                                 RW6_bit             _BIT_ACCESS(PORTW,6)
// PORTW<RW7>
extern volatile __bit                   RW7                 __at(0x807);	// @ (0x100 * 8 + 7)
#define                                 RW7_bit             _BIT_ACCESS(PORTW,7)
// PCON0<RWDT>
extern volatile __bit                   RWDT                __at(0x2784);	// @ (0x4F0 * 8 + 4)
#define                                 RWDT_bit            _BIT_ACCESS(PCON0,4)
// SPI1RXB<RXB0>
extern volatile __bit                   RXB0                __at(0x400);	// @ (0x80 * 8 + 0)
#define                                 RXB0_bit            _BIT_ACCESS(SPI1RXB,0)
// SPI1RXB<RXB1>
extern volatile __bit                   RXB1                __at(0x401);	// @ (0x80 * 8 + 1)
#define                                 RXB1_bit            _BIT_ACCESS(SPI1RXB,1)
// SPI1RXB<RXB2>
extern volatile __bit                   RXB2                __at(0x402);	// @ (0x80 * 8 + 2)
#define                                 RXB2_bit            _BIT_ACCESS(SPI1RXB,2)
// SPI1RXB<RXB3>
extern volatile __bit                   RXB3                __at(0x403);	// @ (0x80 * 8 + 3)
#define                                 RXB3_bit            _BIT_ACCESS(SPI1RXB,3)
// SPI1RXB<RXB4>
extern volatile __bit                   RXB4                __at(0x404);	// @ (0x80 * 8 + 4)
#define                                 RXB4_bit            _BIT_ACCESS(SPI1RXB,4)
// SPI1RXB<RXB5>
extern volatile __bit                   RXB5                __at(0x405);	// @ (0x80 * 8 + 5)
#define                                 RXB5_bit            _BIT_ACCESS(SPI1RXB,5)
// SPI1RXB<RXB6>
extern volatile __bit                   RXB6                __at(0x406);	// @ (0x80 * 8 + 6)
#define                                 RXB6_bit            _BIT_ACCESS(SPI1RXB,6)
// SPI1RXB<RXB7>
extern volatile __bit                   RXB7                __at(0x407);	// @ (0x80 * 8 + 7)
#define                                 RXB7_bit            _BIT_ACCESS(SPI1RXB,7)
// I2C1CON1<RXO>
extern volatile __bit                   RXO                 __at(0x14A2);	// @ (0x294 * 8 + 2)
#define                                 RXO_bit             _BIT_ACCESS(I2C1CON1,2)
// SPI1INTE<RXOIE>
extern volatile __bit                   RXOIE               __at(0x45A);	// @ (0x8B * 8 + 2)
#define                                 RXOIE_bit           _BIT_ACCESS(SPI1INTE,2)
// SPI1INTF<RXOIF>
extern volatile __bit                   RXOIF               __at(0x452);	// @ (0x8A * 8 + 2)
#define                                 RXOIF_bit           _BIT_ACCESS(SPI1INTF,2)
// SPI1CON2<RXR>
extern volatile __bit                   RXR                 __at(0x430);	// @ (0x86 * 8 + 0)
#define                                 RXR_bit             _BIT_ACCESS(SPI1CON2,0)
// BORCON<SBOREN>
extern volatile __bit                   SBOREN              __at(0x24F);	// @ (0x49 * 8 + 7)
#define                                 SBOREN_bit          _BIT_ACCESS(BORCON,7)
// I2C1PIE<SC1IE>
extern volatile __bit                   SC1IE               __at(0x14D8);	// @ (0x29B * 8 + 0)
#define                                 SC1IE_bit           _BIT_ACCESS(I2C1PIE,0)
// I2C1PIR<SC1IF>
extern volatile __bit                   SC1IF               __at(0x14D0);	// @ (0x29A * 8 + 0)
#define                                 SC1IF_bit           _BIT_ACCESS(I2C1PIR,0)
// SCANCON0<SCANEN>
extern volatile __bit                   SCANEN              __at(0x1B07);	// @ (0x360 * 8 + 7)
#define                                 SCANEN_bit          _BIT_ACCESS(SCANCON0,7)
// SCANHADRL<SCANHADR0>
extern volatile __bit                   SCANHADR0           __at(0x1AE8);	// @ (0x35D * 8 + 0)
#define                                 SCANHADR0_bit       _BIT_ACCESS(SCANHADRL,0)
// SCANHADRL<SCANHADR1>
extern volatile __bit                   SCANHADR1           __at(0x1AE9);	// @ (0x35D * 8 + 1)
#define                                 SCANHADR1_bit       _BIT_ACCESS(SCANHADRL,1)
// SCANHADRH<SCANHADR10>
extern volatile __bit                   SCANHADR10          __at(0x1AF2);	// @ (0x35E * 8 + 2)
#define                                 SCANHADR10_bit      _BIT_ACCESS(SCANHADRH,2)
// SCANHADRH<SCANHADR11>
extern volatile __bit                   SCANHADR11          __at(0x1AF3);	// @ (0x35E * 8 + 3)
#define                                 SCANHADR11_bit      _BIT_ACCESS(SCANHADRH,3)
// SCANHADRH<SCANHADR12>
extern volatile __bit                   SCANHADR12          __at(0x1AF4);	// @ (0x35E * 8 + 4)
#define                                 SCANHADR12_bit      _BIT_ACCESS(SCANHADRH,4)
// SCANHADRH<SCANHADR13>
extern volatile __bit                   SCANHADR13          __at(0x1AF5);	// @ (0x35E * 8 + 5)
#define                                 SCANHADR13_bit      _BIT_ACCESS(SCANHADRH,5)
// SCANHADRH<SCANHADR14>
extern volatile __bit                   SCANHADR14          __at(0x1AF6);	// @ (0x35E * 8 + 6)
#define                                 SCANHADR14_bit      _BIT_ACCESS(SCANHADRH,6)
// SCANHADRH<SCANHADR15>
extern volatile __bit                   SCANHADR15          __at(0x1AF7);	// @ (0x35E * 8 + 7)
#define                                 SCANHADR15_bit      _BIT_ACCESS(SCANHADRH,7)
// SCANHADRU<SCANHADR16>
extern volatile __bit                   SCANHADR16          __at(0x1AF8);	// @ (0x35F * 8 + 0)
#define                                 SCANHADR16_bit      _BIT_ACCESS(SCANHADRU,0)
// SCANHADRU<SCANHADR17>
extern volatile __bit                   SCANHADR17          __at(0x1AF9);	// @ (0x35F * 8 + 1)
#define                                 SCANHADR17_bit      _BIT_ACCESS(SCANHADRU,1)
// SCANHADRU<SCANHADR18>
extern volatile __bit                   SCANHADR18          __at(0x1AFA);	// @ (0x35F * 8 + 2)
#define                                 SCANHADR18_bit      _BIT_ACCESS(SCANHADRU,2)
// SCANHADRU<SCANHADR19>
extern volatile __bit                   SCANHADR19          __at(0x1AFB);	// @ (0x35F * 8 + 3)
#define                                 SCANHADR19_bit      _BIT_ACCESS(SCANHADRU,3)
// SCANHADRL<SCANHADR2>
extern volatile __bit                   SCANHADR2           __at(0x1AEA);	// @ (0x35D * 8 + 2)
#define                                 SCANHADR2_bit       _BIT_ACCESS(SCANHADRL,2)
// SCANHADRU<SCANHADR20>
extern volatile __bit                   SCANHADR20          __at(0x1AFC);	// @ (0x35F * 8 + 4)
#define                                 SCANHADR20_bit      _BIT_ACCESS(SCANHADRU,4)
// SCANHADRU<SCANHADR21>
extern volatile __bit                   SCANHADR21          __at(0x1AFD);	// @ (0x35F * 8 + 5)
#define                                 SCANHADR21_bit      _BIT_ACCESS(SCANHADRU,5)
// SCANHADRL<SCANHADR3>
extern volatile __bit                   SCANHADR3           __at(0x1AEB);	// @ (0x35D * 8 + 3)
#define                                 SCANHADR3_bit       _BIT_ACCESS(SCANHADRL,3)
// SCANHADRL<SCANHADR4>
extern volatile __bit                   SCANHADR4           __at(0x1AEC);	// @ (0x35D * 8 + 4)
#define                                 SCANHADR4_bit       _BIT_ACCESS(SCANHADRL,4)
// SCANHADRL<SCANHADR5>
extern volatile __bit                   SCANHADR5           __at(0x1AED);	// @ (0x35D * 8 + 5)
#define                                 SCANHADR5_bit       _BIT_ACCESS(SCANHADRL,5)
// SCANHADRL<SCANHADR6>
extern volatile __bit                   SCANHADR6           __at(0x1AEE);	// @ (0x35D * 8 + 6)
#define                                 SCANHADR6_bit       _BIT_ACCESS(SCANHADRL,6)
// SCANHADRL<SCANHADR7>
extern volatile __bit                   SCANHADR7           __at(0x1AEF);	// @ (0x35D * 8 + 7)
#define                                 SCANHADR7_bit       _BIT_ACCESS(SCANHADRL,7)
// SCANHADRH<SCANHADR8>
extern volatile __bit                   SCANHADR8           __at(0x1AF0);	// @ (0x35E * 8 + 0)
#define                                 SCANHADR8_bit       _BIT_ACCESS(SCANHADRH,0)
// SCANHADRH<SCANHADR9>
extern volatile __bit                   SCANHADR9           __at(0x1AF1);	// @ (0x35E * 8 + 1)
#define                                 SCANHADR9_bit       _BIT_ACCESS(SCANHADRH,1)
// PIE8<SCANIE>
extern volatile __bit                   SCANIE              __at(0x257F);	// @ (0x4AF * 8 + 7)
#define                                 SCANIE_bit          _BIT_ACCESS(PIE8,7)
// PIR8<SCANIF>
extern volatile __bit                   SCANIF              __at(0x25D7);	// @ (0x4BA * 8 + 7)
#define                                 SCANIF_bit          _BIT_ACCESS(PIR8,7)
// IPR8<SCANIP>
extern volatile __bit                   SCANIP              __at(0x2527);	// @ (0x4A4 * 8 + 7)
#define                                 SCANIP_bit          _BIT_ACCESS(IPR8,7)
// SCANLADRL<SCANLADR0>
extern volatile __bit                   SCANLADR0           __at(0x1AD0);	// @ (0x35A * 8 + 0)
#define                                 SCANLADR0_bit       _BIT_ACCESS(SCANLADRL,0)
// SCANLADRL<SCANLADR1>
extern volatile __bit                   SCANLADR1           __at(0x1AD1);	// @ (0x35A * 8 + 1)
#define                                 SCANLADR1_bit       _BIT_ACCESS(SCANLADRL,1)
// SCANLADRH<SCANLADR10>
extern volatile __bit                   SCANLADR10          __at(0x1ADA);	// @ (0x35B * 8 + 2)
#define                                 SCANLADR10_bit      _BIT_ACCESS(SCANLADRH,2)
// SCANLADRH<SCANLADR11>
extern volatile __bit                   SCANLADR11          __at(0x1ADB);	// @ (0x35B * 8 + 3)
#define                                 SCANLADR11_bit      _BIT_ACCESS(SCANLADRH,3)
// SCANLADRH<SCANLADR12>
extern volatile __bit                   SCANLADR12          __at(0x1ADC);	// @ (0x35B * 8 + 4)
#define                                 SCANLADR12_bit      _BIT_ACCESS(SCANLADRH,4)
// SCANLADRH<SCANLADR13>
extern volatile __bit                   SCANLADR13          __at(0x1ADD);	// @ (0x35B * 8 + 5)
#define                                 SCANLADR13_bit      _BIT_ACCESS(SCANLADRH,5)
// SCANLADRH<SCANLADR14>
extern volatile __bit                   SCANLADR14          __at(0x1ADE);	// @ (0x35B * 8 + 6)
#define                                 SCANLADR14_bit      _BIT_ACCESS(SCANLADRH,6)
// SCANLADRH<SCANLADR15>
extern volatile __bit                   SCANLADR15          __at(0x1ADF);	// @ (0x35B * 8 + 7)
#define                                 SCANLADR15_bit      _BIT_ACCESS(SCANLADRH,7)
// SCANLADRU<SCANLADR16>
extern volatile __bit                   SCANLADR16          __at(0x1AE0);	// @ (0x35C * 8 + 0)
#define                                 SCANLADR16_bit      _BIT_ACCESS(SCANLADRU,0)
// SCANLADRU<SCANLADR17>
extern volatile __bit                   SCANLADR17          __at(0x1AE1);	// @ (0x35C * 8 + 1)
#define                                 SCANLADR17_bit      _BIT_ACCESS(SCANLADRU,1)
// SCANLADRU<SCANLADR18>
extern volatile __bit                   SCANLADR18          __at(0x1AE2);	// @ (0x35C * 8 + 2)
#define                                 SCANLADR18_bit      _BIT_ACCESS(SCANLADRU,2)
// SCANLADRU<SCANLADR19>
extern volatile __bit                   SCANLADR19          __at(0x1AE3);	// @ (0x35C * 8 + 3)
#define                                 SCANLADR19_bit      _BIT_ACCESS(SCANLADRU,3)
// SCANLADRL<SCANLADR2>
extern volatile __bit                   SCANLADR2           __at(0x1AD2);	// @ (0x35A * 8 + 2)
#define                                 SCANLADR2_bit       _BIT_ACCESS(SCANLADRL,2)
// SCANLADRU<SCANLADR20>
extern volatile __bit                   SCANLADR20          __at(0x1AE4);	// @ (0x35C * 8 + 4)
#define                                 SCANLADR20_bit      _BIT_ACCESS(SCANLADRU,4)
// SCANLADRU<SCANLADR21>
extern volatile __bit                   SCANLADR21          __at(0x1AE5);	// @ (0x35C * 8 + 5)
#define                                 SCANLADR21_bit      _BIT_ACCESS(SCANLADRU,5)
// SCANLADRL<SCANLADR3>
extern volatile __bit                   SCANLADR3           __at(0x1AD3);	// @ (0x35A * 8 + 3)
#define                                 SCANLADR3_bit       _BIT_ACCESS(SCANLADRL,3)
// SCANLADRL<SCANLADR4>
extern volatile __bit                   SCANLADR4           __at(0x1AD4);	// @ (0x35A * 8 + 4)
#define                                 SCANLADR4_bit       _BIT_ACCESS(SCANLADRL,4)
// SCANLADRL<SCANLADR5>
extern volatile __bit                   SCANLADR5           __at(0x1AD5);	// @ (0x35A * 8 + 5)
#define                                 SCANLADR5_bit       _BIT_ACCESS(SCANLADRL,5)
// SCANLADRL<SCANLADR6>
extern volatile __bit                   SCANLADR6           __at(0x1AD6);	// @ (0x35A * 8 + 6)
#define                                 SCANLADR6_bit       _BIT_ACCESS(SCANLADRL,6)
// SCANLADRL<SCANLADR7>
extern volatile __bit                   SCANLADR7           __at(0x1AD7);	// @ (0x35A * 8 + 7)
#define                                 SCANLADR7_bit       _BIT_ACCESS(SCANLADRL,7)
// SCANLADRH<SCANLADR8>
extern volatile __bit                   SCANLADR8           __at(0x1AD8);	// @ (0x35B * 8 + 0)
#define                                 SCANLADR8_bit       _BIT_ACCESS(SCANLADRH,0)
// SCANLADRH<SCANLADR9>
extern volatile __bit                   SCANLADR9           __at(0x1AD9);	// @ (0x35B * 8 + 1)
#define                                 SCANLADR9_bit       _BIT_ACCESS(SCANLADRH,1)
// PMD0<SCANMD>
extern volatile __bit                   SCANMD              __at(0x313);	// @ (0x62 * 8 + 3)
#define                                 SCANMD_bit          _BIT_ACCESS(PMD0,3)
// SCANPR<SCANPR0>
extern volatile __bit                   SCANPR0             __at(0x5A8);	// @ (0xB5 * 8 + 0)
#define                                 SCANPR0_bit         _BIT_ACCESS(SCANPR,0)
// SCANPR<SCANPR1>
extern volatile __bit                   SCANPR1             __at(0x5A9);	// @ (0xB5 * 8 + 1)
#define                                 SCANPR1_bit         _BIT_ACCESS(SCANPR,1)
// SCANPR<SCANPR2>
extern volatile __bit                   SCANPR2             __at(0x5AA);	// @ (0xB5 * 8 + 2)
#define                                 SCANPR2_bit         _BIT_ACCESS(SCANPR,2)
// I2C1PIE<SCIE>
extern volatile __bit                   SCIE                __at(0x14D8);	// @ (0x29B * 8 + 0)
#define                                 SCIE_bit            _BIT_ACCESS(I2C1PIE,0)
// I2C1PIR<SCIF>
extern volatile __bit                   SCIF                __at(0x14D0);	// @ (0x29A * 8 + 0)
#define                                 SCIF_bit            _BIT_ACCESS(I2C1PIR,0)
// DMAnSCNTL<SCNT0>
extern volatile __bit                   SCNT0               __at(0x790);	// @ (0xF2 * 8 + 0)
#define                                 SCNT0_bit           _BIT_ACCESS(DMAnSCNTL,0)
// DMAnSCNTL<SCNT1>
extern volatile __bit                   SCNT1               __at(0x791);	// @ (0xF2 * 8 + 1)
#define                                 SCNT1_bit           _BIT_ACCESS(DMAnSCNTL,1)
// DMAnSCNTH<SCNT10>
extern volatile __bit                   SCNT10              __at(0x79A);	// @ (0xF3 * 8 + 2)
#define                                 SCNT10_bit          _BIT_ACCESS(DMAnSCNTH,2)
// DMAnSCNTH<SCNT11>
extern volatile __bit                   SCNT11              __at(0x79B);	// @ (0xF3 * 8 + 3)
#define                                 SCNT11_bit          _BIT_ACCESS(DMAnSCNTH,3)
