GopalSaraf/Practicals/PSDL/include/proc/pic18f56q71.h
extern volatile __bit                   TU16BCR0            __at(0x1D70);	// @ (0x3AE * 8 + 0)
#define                                 TU16BCR0_bit        _BIT_ACCESS(TU16BCRL,0)
// TU16BCRL<TU16BCR1>
extern volatile __bit                   TU16BCR1            __at(0x1D71);	// @ (0x3AE * 8 + 1)
#define                                 TU16BCR1_bit        _BIT_ACCESS(TU16BCRL,1)
// TU16BCRH<TU16BCR10>
extern volatile __bit                   TU16BCR10           __at(0x1D7A);	// @ (0x3AF * 8 + 2)
#define                                 TU16BCR10_bit       _BIT_ACCESS(TU16BCRH,2)
// TU16BCRH<TU16BCR11>
extern volatile __bit                   TU16BCR11           __at(0x1D7B);	// @ (0x3AF * 8 + 3)
#define                                 TU16BCR11_bit       _BIT_ACCESS(TU16BCRH,3)
// TU16BCRH<TU16BCR12>
extern volatile __bit                   TU16BCR12           __at(0x1D7C);	// @ (0x3AF * 8 + 4)
#define                                 TU16BCR12_bit       _BIT_ACCESS(TU16BCRH,4)
// TU16BCRH<TU16BCR13>
extern volatile __bit                   TU16BCR13           __at(0x1D7D);	// @ (0x3AF * 8 + 5)
#define                                 TU16BCR13_bit       _BIT_ACCESS(TU16BCRH,5)
// TU16BCRH<TU16BCR14>
extern volatile __bit                   TU16BCR14           __at(0x1D7E);	// @ (0x3AF * 8 + 6)
#define                                 TU16BCR14_bit       _BIT_ACCESS(TU16BCRH,6)
// TU16BCRH<TU16BCR15>
extern volatile __bit                   TU16BCR15           __at(0x1D7F);	// @ (0x3AF * 8 + 7)
#define                                 TU16BCR15_bit       _BIT_ACCESS(TU16BCRH,7)
// TU16BCRL<TU16BCR2>
extern volatile __bit                   TU16BCR2            __at(0x1D72);	// @ (0x3AE * 8 + 2)
#define                                 TU16BCR2_bit        _BIT_ACCESS(TU16BCRL,2)
// TU16BCRL<TU16BCR3>
extern volatile __bit                   TU16BCR3            __at(0x1D73);	// @ (0x3AE * 8 + 3)
#define                                 TU16BCR3_bit        _BIT_ACCESS(TU16BCRL,3)
// TU16BCRL<TU16BCR4>
extern volatile __bit                   TU16BCR4            __at(0x1D74);	// @ (0x3AE * 8 + 4)
#define                                 TU16BCR4_bit        _BIT_ACCESS(TU16BCRL,4)
// TU16BCRL<TU16BCR5>
extern volatile __bit                   TU16BCR5            __at(0x1D75);	// @ (0x3AE * 8 + 5)
#define                                 TU16BCR5_bit        _BIT_ACCESS(TU16BCRL,5)
// TU16BCRL<TU16BCR6>
extern volatile __bit                   TU16BCR6            __at(0x1D76);	// @ (0x3AE * 8 + 6)
#define                                 TU16BCR6_bit        _BIT_ACCESS(TU16BCRL,6)
// TU16BCRL<TU16BCR7>
extern volatile __bit                   TU16BCR7            __at(0x1D77);	// @ (0x3AE * 8 + 7)
#define                                 TU16BCR7_bit        _BIT_ACCESS(TU16BCRL,7)
// TU16BCRH<TU16BCR8>
extern volatile __bit                   TU16BCR8            __at(0x1D78);	// @ (0x3AF * 8 + 0)
#define                                 TU16BCR8_bit        _BIT_ACCESS(TU16BCRH,0)
// TU16BCRH<TU16BCR9>
extern volatile __bit                   TU16BCR9            __at(0x1D79);	// @ (0x3AF * 8 + 1)
#define                                 TU16BCR9_bit        _BIT_ACCESS(TU16BCRH,1)
// TU16BCRH<TU16BCRH0>
extern volatile __bit                   TU16BCRH0           __at(0x1D78);	// @ (0x3AF * 8 + 0)
#define                                 TU16BCRH0_bit       _BIT_ACCESS(TU16BCRH,0)
// TU16BCRH<TU16BCRH1>
extern volatile __bit                   TU16BCRH1           __at(0x1D79);	// @ (0x3AF * 8 + 1)
#define                                 TU16BCRH1_bit       _BIT_ACCESS(TU16BCRH,1)
// TU16BCRH<TU16BCRH2>
extern volatile __bit                   TU16BCRH2           __at(0x1D7A);	// @ (0x3AF * 8 + 2)
#define                                 TU16BCRH2_bit       _BIT_ACCESS(TU16BCRH,2)
// TU16BCRH<TU16BCRH3>
extern volatile __bit                   TU16BCRH3           __at(0x1D7B);	// @ (0x3AF * 8 + 3)
#define                                 TU16BCRH3_bit       _BIT_ACCESS(TU16BCRH,3)
// TU16BCRH<TU16BCRH4>
extern volatile __bit                   TU16BCRH4           __at(0x1D7C);	// @ (0x3AF * 8 + 4)
#define                                 TU16BCRH4_bit       _BIT_ACCESS(TU16BCRH,4)
// TU16BCRH<TU16BCRH5>
extern volatile __bit                   TU16BCRH5           __at(0x1D7D);	// @ (0x3AF * 8 + 5)
#define                                 TU16BCRH5_bit       _BIT_ACCESS(TU16BCRH,5)
// TU16BCRH<TU16BCRH6>
extern volatile __bit                   TU16BCRH6           __at(0x1D7E);	// @ (0x3AF * 8 + 6)
#define                                 TU16BCRH6_bit       _BIT_ACCESS(TU16BCRH,6)
// TU16BCRH<TU16BCRH7>
extern volatile __bit                   TU16BCRH7           __at(0x1D7F);	// @ (0x3AF * 8 + 7)
#define                                 TU16BCRH7_bit       _BIT_ACCESS(TU16BCRH,7)
// TU16BCRL<TU16BCRL0>
extern volatile __bit                   TU16BCRL0           __at(0x1D70);	// @ (0x3AE * 8 + 0)
#define                                 TU16BCRL0_bit       _BIT_ACCESS(TU16BCRL,0)
// TU16BCRL<TU16BCRL1>
extern volatile __bit                   TU16BCRL1           __at(0x1D71);	// @ (0x3AE * 8 + 1)
#define                                 TU16BCRL1_bit       _BIT_ACCESS(TU16BCRL,1)
// TU16BCRL<TU16BCRL2>
extern volatile __bit                   TU16BCRL2           __at(0x1D72);	// @ (0x3AE * 8 + 2)
#define                                 TU16BCRL2_bit       _BIT_ACCESS(TU16BCRL,2)
// TU16BCRL<TU16BCRL3>
extern volatile __bit                   TU16BCRL3           __at(0x1D73);	// @ (0x3AE * 8 + 3)
#define                                 TU16BCRL3_bit       _BIT_ACCESS(TU16BCRL,3)
// TU16BCRL<TU16BCRL4>
extern volatile __bit                   TU16BCRL4           __at(0x1D74);	// @ (0x3AE * 8 + 4)
#define                                 TU16BCRL4_bit       _BIT_ACCESS(TU16BCRL,4)
// TU16BCRL<TU16BCRL5>
extern volatile __bit                   TU16BCRL5           __at(0x1D75);	// @ (0x3AE * 8 + 5)
#define                                 TU16BCRL5_bit       _BIT_ACCESS(TU16BCRL,5)
// TU16BCRL<TU16BCRL6>
extern volatile __bit                   TU16BCRL6           __at(0x1D76);	// @ (0x3AE * 8 + 6)
#define                                 TU16BCRL6_bit       _BIT_ACCESS(TU16BCRL,6)
// TU16BCRL<TU16BCRL7>
extern volatile __bit                   TU16BCRL7           __at(0x1D77);	// @ (0x3AE * 8 + 7)
#define                                 TU16BCRL7_bit       _BIT_ACCESS(TU16BCRL,7)
// TU16BHLT<TU16BCSYNC>
extern volatile __bit                   TU16BCSYNC          __at(0x1D66);	// @ (0x3AC * 8 + 6)
#define                                 TU16BCSYNC_bit      _BIT_ACCESS(TU16BHLT,6)
// TU16BHLT<TU16BEPOL>
extern volatile __bit                   TU16BEPOL           __at(0x1D67);	// @ (0x3AC * 8 + 7)
#define                                 TU16BEPOL_bit       _BIT_ACCESS(TU16BHLT,7)
// TU16BERS<TU16BERS0>
extern volatile __bit                   TU16BERS0           __at(0x1D98);	// @ (0x3B3 * 8 + 0)
#define                                 TU16BERS0_bit       _BIT_ACCESS(TU16BERS,0)
// TU16BERS<TU16BERS1>
extern volatile __bit                   TU16BERS1           __at(0x1D99);	// @ (0x3B3 * 8 + 1)
#define                                 TU16BERS1_bit       _BIT_ACCESS(TU16BERS,1)
// TU16BERS<TU16BERS2>
extern volatile __bit                   TU16BERS2           __at(0x1D9A);	// @ (0x3B3 * 8 + 2)
#define                                 TU16BERS2_bit       _BIT_ACCESS(TU16BERS,2)
// TU16BERS<TU16BERS3>
extern volatile __bit                   TU16BERS3           __at(0x1D9B);	// @ (0x3B3 * 8 + 3)
#define                                 TU16BERS3_bit       _BIT_ACCESS(TU16BERS,3)
// TU16BERS<TU16BERS4>
extern volatile __bit                   TU16BERS4           __at(0x1D9C);	// @ (0x3B3 * 8 + 4)
#define                                 TU16BERS4_bit       _BIT_ACCESS(TU16BERS,4)
// PIE10<TU16BIE>
extern volatile __bit                   TU16BIE             __at(0x258A);	// @ (0x4B1 * 8 + 2)
#define                                 TU16BIE_bit         _BIT_ACCESS(PIE10,2)
// PIR10<TU16BIF>
extern volatile __bit                   TU16BIF             __at(0x25E2);	// @ (0x4BC * 8 + 2)
#define                                 TU16BIF_bit         _BIT_ACCESS(PIR10,2)
// IPR10<TU16BIP>
extern volatile __bit                   TU16BIP             __at(0x2532);	// @ (0x4A6 * 8 + 2)
#define                                 TU16BIP_bit         _BIT_ACCESS(IPR10,2)
// TU16BCON1<TU16BLIMIT>
extern volatile __bit                   TU16BLIMIT          __at(0x1D5C);	// @ (0x3AB * 8 + 4)
#define                                 TU16BLIMIT_bit      _BIT_ACCESS(TU16BCON1,4)
// PMD6<TU16BMD>
extern volatile __bit                   TU16BMD             __at(0x341);	// @ (0x68 * 8 + 1)
#define                                 TU16BMD_bit         _BIT_ACCESS(PMD6,1)
// TU16BCON0<TU16BOM>
extern volatile __bit                   TU16BOM             __at(0x1D55);	// @ (0x3AA * 8 + 5)
#define                                 TU16BOM_bit         _BIT_ACCESS(TU16BCON0,5)
// TU16BCON0<TU16BON>
extern volatile __bit                   TU16BON             __at(0x1D57);	// @ (0x3AA * 8 + 7)
#define                                 TU16BON_bit         _BIT_ACCESS(TU16BCON0,7)
// TU16BCON0<TU16BOPOL>
extern volatile __bit                   TU16BOPOL           __at(0x1D54);	// @ (0x3AA * 8 + 4)
#define                                 TU16BOPOL_bit       _BIT_ACCESS(TU16BCON0,4)
// TU16BPRL<TU16BPR0>
extern volatile __bit                   TU16BPR0            __at(0x1D80);	// @ (0x3B0 * 8 + 0)
#define                                 TU16BPR0_bit        _BIT_ACCESS(TU16BPRL,0)
// TU16BPRL<TU16BPR1>
extern volatile __bit                   TU16BPR1            __at(0x1D81);	// @ (0x3B0 * 8 + 1)
#define                                 TU16BPR1_bit        _BIT_ACCESS(TU16BPRL,1)
// TU16BPRH<TU16BPR10>
extern volatile __bit                   TU16BPR10           __at(0x1D8A);	// @ (0x3B1 * 8 + 2)
#define                                 TU16BPR10_bit       _BIT_ACCESS(TU16BPRH,2)
// TU16BPRH<TU16BPR11>
extern volatile __bit                   TU16BPR11           __at(0x1D8B);	// @ (0x3B1 * 8 + 3)
#define                                 TU16BPR11_bit       _BIT_ACCESS(TU16BPRH,3)
// TU16BPRH<TU16BPR12>
extern volatile __bit                   TU16BPR12           __at(0x1D8C);	// @ (0x3B1 * 8 + 4)
#define                                 TU16BPR12_bit       _BIT_ACCESS(TU16BPRH,4)
// TU16BPRH<TU16BPR13>
extern volatile __bit                   TU16BPR13           __at(0x1D8D);	// @ (0x3B1 * 8 + 5)
#define                                 TU16BPR13_bit       _BIT_ACCESS(TU16BPRH,5)
// TU16BPRH<TU16BPR14>
extern volatile __bit                   TU16BPR14           __at(0x1D8E);	// @ (0x3B1 * 8 + 6)
#define                                 TU16BPR14_bit       _BIT_ACCESS(TU16BPRH,6)
// TU16BPRH<TU16BPR15>
extern volatile __bit                   TU16BPR15           __at(0x1D8F);	// @ (0x3B1 * 8 + 7)
#define                                 TU16BPR15_bit       _BIT_ACCESS(TU16BPRH,7)
// TU16BPRL<TU16BPR2>
extern volatile __bit                   TU16BPR2            __at(0x1D82);	// @ (0x3B0 * 8 + 2)
#define                                 TU16BPR2_bit        _BIT_ACCESS(TU16BPRL,2)
// TU16BPRL<TU16BPR3>
extern volatile __bit                   TU16BPR3            __at(0x1D83);	// @ (0x3B0 * 8 + 3)
#define                                 TU16BPR3_bit        _BIT_ACCESS(TU16BPRL,3)
// TU16BPRL<TU16BPR4>
extern volatile __bit                   TU16BPR4            __at(0x1D84);	// @ (0x3B0 * 8 + 4)
#define                                 TU16BPR4_bit        _BIT_ACCESS(TU16BPRL,4)
// TU16BPRL<TU16BPR5>
extern volatile __bit                   TU16BPR5            __at(0x1D85);	// @ (0x3B0 * 8 + 5)
#define                                 TU16BPR5_bit        _BIT_ACCESS(TU16BPRL,5)
// TU16BPRL<TU16BPR6>
extern volatile __bit                   TU16BPR6            __at(0x1D86);	// @ (0x3B0 * 8 + 6)
#define                                 TU16BPR6_bit        _BIT_ACCESS(TU16BPRL,6)
// TU16BPRL<TU16BPR7>
extern volatile __bit                   TU16BPR7            __at(0x1D87);	// @ (0x3B0 * 8 + 7)
#define                                 TU16BPR7_bit        _BIT_ACCESS(TU16BPRL,7)
// TU16BPRH<TU16BPR8>
extern volatile __bit                   TU16BPR8            __at(0x1D88);	// @ (0x3B1 * 8 + 0)
#define                                 TU16BPR8_bit        _BIT_ACCESS(TU16BPRH,0)
// TU16BPRH<TU16BPR9>
extern volatile __bit                   TU16BPR9            __at(0x1D89);	// @ (0x3B1 * 8 + 1)
#define                                 TU16BPR9_bit        _BIT_ACCESS(TU16BPRH,1)
// TU16BPRH<TU16BPRH0>
extern volatile __bit                   TU16BPRH0           __at(0x1D88);	// @ (0x3B1 * 8 + 0)
#define                                 TU16BPRH0_bit       _BIT_ACCESS(TU16BPRH,0)
// TU16BPRH<TU16BPRH1>
extern volatile __bit                   TU16BPRH1           __at(0x1D89);	// @ (0x3B1 * 8 + 1)
#define                                 TU16BPRH1_bit       _BIT_ACCESS(TU16BPRH,1)
// TU16BPRH<TU16BPRH2>
extern volatile __bit                   TU16BPRH2           __at(0x1D8A);	// @ (0x3B1 * 8 + 2)
#define                                 TU16BPRH2_bit       _BIT_ACCESS(TU16BPRH,2)
// TU16BPRH<TU16BPRH3>
extern volatile __bit                   TU16BPRH3           __at(0x1D8B);	// @ (0x3B1 * 8 + 3)
#define                                 TU16BPRH3_bit       _BIT_ACCESS(TU16BPRH,3)
// TU16BPRH<TU16BPRH4>
extern volatile __bit                   TU16BPRH4           __at(0x1D8C);	// @ (0x3B1 * 8 + 4)
#define                                 TU16BPRH4_bit       _BIT_ACCESS(TU16BPRH,4)
// TU16BPRH<TU16BPRH5>
extern volatile __bit                   TU16BPRH5           __at(0x1D8D);	// @ (0x3B1 * 8 + 5)
#define                                 TU16BPRH5_bit       _BIT_ACCESS(TU16BPRH,5)
// TU16BPRH<TU16BPRH6>
extern volatile __bit                   TU16BPRH6           __at(0x1D8E);	// @ (0x3B1 * 8 + 6)
#define                                 TU16BPRH6_bit       _BIT_ACCESS(TU16BPRH,6)
// TU16BPRH<TU16BPRH7>
extern volatile __bit                   TU16BPRH7           __at(0x1D8F);	// @ (0x3B1 * 8 + 7)
#define                                 TU16BPRH7_bit       _BIT_ACCESS(TU16BPRH,7)
// TU16BCON0<TU16BPRIE>
extern volatile __bit                   TU16BPRIE           __at(0x1D52);	// @ (0x3AA * 8 + 2)
#define                                 TU16BPRIE_bit       _BIT_ACCESS(TU16BCON0,2)
// TU16BCON1<TU16BPRIF>
extern volatile __bit                   TU16BPRIF           __at(0x1D5A);	// @ (0x3AB * 8 + 2)
#define                                 TU16BPRIF_bit       _BIT_ACCESS(TU16BCON1,2)
// TU16BPRL<TU16BPRL0>
extern volatile __bit                   TU16BPRL0           __at(0x1D80);	// @ (0x3B0 * 8 + 0)
#define                                 TU16BPRL0_bit       _BIT_ACCESS(TU16BPRL,0)
// TU16BPRL<TU16BPRL1>
extern volatile __bit                   TU16BPRL1           __at(0x1D81);	// @ (0x3B0 * 8 + 1)
#define                                 TU16BPRL1_bit       _BIT_ACCESS(TU16BPRL,1)
// TU16BPRL<TU16BPRL2>
extern volatile __bit                   TU16BPRL2           __at(0x1D82);	// @ (0x3B0 * 8 + 2)
#define                                 TU16BPRL2_bit       _BIT_ACCESS(TU16BPRL,2)
// TU16BPRL<TU16BPRL3>
extern volatile __bit                   TU16BPRL3           __at(0x1D83);	// @ (0x3B0 * 8 + 3)
#define                                 TU16BPRL3_bit       _BIT_ACCESS(TU16BPRL,3)
// TU16BPRL<TU16BPRL4>
extern volatile __bit                   TU16BPRL4           __at(0x1D84);	// @ (0x3B0 * 8 + 4)
#define                                 TU16BPRL4_bit       _BIT_ACCESS(TU16BPRL,4)
// TU16BPRL<TU16BPRL5>
extern volatile __bit                   TU16BPRL5           __at(0x1D85);	// @ (0x3B0 * 8 + 5)
#define                                 TU16BPRL5_bit       _BIT_ACCESS(TU16BPRL,5)
// TU16BPRL<TU16BPRL6>
extern volatile __bit                   TU16BPRL6           __at(0x1D86);	// @ (0x3B0 * 8 + 6)
#define                                 TU16BPRL6_bit       _BIT_ACCESS(TU16BPRL,6)
// TU16BPRL<TU16BPRL7>
extern volatile __bit                   TU16BPRL7           __at(0x1D87);	// @ (0x3B0 * 8 + 7)
#define                                 TU16BPRL7_bit       _BIT_ACCESS(TU16BPRL,7)
// TU16BPS<TU16BPS0>
extern volatile __bit                   TU16BPS0            __at(0x1D68);	// @ (0x3AD * 8 + 0)
#define                                 TU16BPS0_bit        _BIT_ACCESS(TU16BPS,0)
// TU16BPS<TU16BPS1>
extern volatile __bit                   TU16BPS1            __at(0x1D69);	// @ (0x3AD * 8 + 1)
#define                                 TU16BPS1_bit        _BIT_ACCESS(TU16BPS,1)
// TU16BPS<TU16BPS2>
extern volatile __bit                   TU16BPS2            __at(0x1D6A);	// @ (0x3AD * 8 + 2)
#define                                 TU16BPS2_bit        _BIT_ACCESS(TU16BPS,2)
// TU16BPS<TU16BPS3>
extern volatile __bit                   TU16BPS3            __at(0x1D6B);	// @ (0x3AD * 8 + 3)
#define                                 TU16BPS3_bit        _BIT_ACCESS(TU16BPS,3)
// TU16BPS<TU16BPS4>
extern volatile __bit                   TU16BPS4            __at(0x1D6C);	// @ (0x3AD * 8 + 4)
#define                                 TU16BPS4_bit        _BIT_ACCESS(TU16BPS,4)
// TU16BPS<TU16BPS5>
extern volatile __bit                   TU16BPS5            __at(0x1D6D);	// @ (0x3AD * 8 + 5)
#define                                 TU16BPS5_bit        _BIT_ACCESS(TU16BPS,5)
// TU16BPS<TU16BPS6>
extern volatile __bit                   TU16BPS6            __at(0x1D6E);	// @ (0x3AD * 8 + 6)
#define                                 TU16BPS6_bit        _BIT_ACCESS(TU16BPS,6)
// TU16BPS<TU16BPS7>
extern volatile __bit                   TU16BPS7            __at(0x1D6F);	// @ (0x3AD * 8 + 7)
#define                                 TU16BPS7_bit        _BIT_ACCESS(TU16BPS,7)
// TU16BCON0<TU16BRDSEL>
extern volatile __bit                   TU16BRDSEL          __at(0x1D53);	// @ (0x3AA * 8 + 3)
#define                                 TU16BRDSEL_bit      _BIT_ACCESS(TU16BCON0,3)
// TU16BHLT<TU16BRESET0>
extern volatile __bit                   TU16BRESET0         __at(0x1D62);	// @ (0x3AC * 8 + 2)
#define                                 TU16BRESET0_bit     _BIT_ACCESS(TU16BHLT,2)
// TU16BHLT<TU16BRESET1>
extern volatile __bit                   TU16BRESET1         __at(0x1D63);	// @ (0x3AC * 8 + 3)
#define                                 TU16BRESET1_bit     _BIT_ACCESS(TU16BHLT,3)
// TU16BCON1<TU16BRUN>
extern volatile __bit                   TU16BRUN            __at(0x1D5F);	// @ (0x3AB * 8 + 7)
#define                                 TU16BRUN_bit        _BIT_ACCESS(TU16BCON1,7)
// TU16BHLT<TU16BSTART0>
extern volatile __bit                   TU16BSTART0         __at(0x1D64);	// @ (0x3AC * 8 + 4)
#define                                 TU16BSTART0_bit     _BIT_ACCESS(TU16BHLT,4)
// TU16BHLT<TU16BSTART1>
extern volatile __bit                   TU16BSTART1         __at(0x1D65);	// @ (0x3AC * 8 + 5)
#define                                 TU16BSTART1_bit     _BIT_ACCESS(TU16BHLT,5)
// TU16BHLT<TU16BSTOP0>
extern volatile __bit                   TU16BSTOP0          __at(0x1D60);	// @ (0x3AC * 8 + 0)
#define                                 TU16BSTOP0_bit      _BIT_ACCESS(TU16BHLT,0)
// TU16BHLT<TU16BSTOP1>
extern volatile __bit                   TU16BSTOP1          __at(0x1D61);	// @ (0x3AC * 8 + 1)
#define                                 TU16BSTOP1_bit      _BIT_ACCESS(TU16BHLT,1)
// TU16BTMRL<TU16BTMR0>
extern volatile __bit                   TU16BTMR0           __at(0x1D70);	// @ (0x3AE * 8 + 0)
#define                                 TU16BTMR0_bit       _BIT_ACCESS(TU16BTMRL,0)
// TU16BTMRL<TU16BTMR1>
extern volatile __bit                   TU16BTMR1           __at(0x1D71);	// @ (0x3AE * 8 + 1)
#define                                 TU16BTMR1_bit       _BIT_ACCESS(TU16BTMRL,1)
// TU16BTMRH<TU16BTMR10>
extern volatile __bit                   TU16BTMR10          __at(0x1D7A);	// @ (0x3AF * 8 + 2)
#define                                 TU16BTMR10_bit      _BIT_ACCESS(TU16BTMRH,2)
// TU16BTMRH<TU16BTMR11>
extern volatile __bit                   TU16BTMR11          __at(0x1D7B);	// @ (0x3AF * 8 + 3)
#define                                 TU16BTMR11_bit      _BIT_ACCESS(TU16BTMRH,3)
// TU16BTMRH<TU16BTMR12>
extern volatile __bit                   TU16BTMR12          __at(0x1D7C);	// @ (0x3AF * 8 + 4)
#define                                 TU16BTMR12_bit      _BIT_ACCESS(TU16BTMRH,4)
// TU16BTMRH<TU16BTMR13>
extern volatile __bit                   TU16BTMR13          __at(0x1D7D);	// @ (0x3AF * 8 + 5)
#define                                 TU16BTMR13_bit      _BIT_ACCESS(TU16BTMRH,5)
// TU16BTMRH<TU16BTMR14>
extern volatile __bit                   TU16BTMR14          __at(0x1D7E);	// @ (0x3AF * 8 + 6)
#define                                 TU16BTMR14_bit      _BIT_ACCESS(TU16BTMRH,6)
// TU16BTMRH<TU16BTMR15>
extern volatile __bit                   TU16BTMR15          __at(0x1D7F);	// @ (0x3AF * 8 + 7)
#define                                 TU16BTMR15_bit      _BIT_ACCESS(TU16BTMRH,7)
// TU16BTMRL<TU16BTMR2>
extern volatile __bit                   TU16BTMR2           __at(0x1D72);	// @ (0x3AE * 8 + 2)
#define                                 TU16BTMR2_bit       _BIT_ACCESS(TU16BTMRL,2)
// TU16BTMRL<TU16BTMR3>
extern volatile __bit                   TU16BTMR3           __at(0x1D73);	// @ (0x3AE * 8 + 3)
#define                                 TU16BTMR3_bit       _BIT_ACCESS(TU16BTMRL,3)
// TU16BTMRL<TU16BTMR4>
extern volatile __bit                   TU16BTMR4           __at(0x1D74);	// @ (0x3AE * 8 + 4)
#define                                 TU16BTMR4_bit       _BIT_ACCESS(TU16BTMRL,4)
// TU16BTMRL<TU16BTMR5>
extern volatile __bit                   TU16BTMR5           __at(0x1D75);	// @ (0x3AE * 8 + 5)
#define                                 TU16BTMR5_bit       _BIT_ACCESS(TU16BTMRL,5)
// TU16BTMRL<TU16BTMR6>
extern volatile __bit                   TU16BTMR6           __at(0x1D76);	// @ (0x3AE * 8 + 6)
#define                                 TU16BTMR6_bit       _BIT_ACCESS(TU16BTMRL,6)
// TU16BTMRL<TU16BTMR7>
extern volatile __bit                   TU16BTMR7           __at(0x1D77);	// @ (0x3AE * 8 + 7)
#define                                 TU16BTMR7_bit       _BIT_ACCESS(TU16BTMRL,7)
// TU16BTMRH<TU16BTMR8>
extern volatile __bit                   TU16BTMR8           __at(0x1D78);	// @ (0x3AF * 8 + 0)
#define                                 TU16BTMR8_bit       _BIT_ACCESS(TU16BTMRH,0)
// TU16BTMRH<TU16BTMR9>
extern volatile __bit                   TU16BTMR9           __at(0x1D79);	// @ (0x3AF * 8 + 1)
#define                                 TU16BTMR9_bit       _BIT_ACCESS(TU16BTMRH,1)
// TU16BTMRH<TU16BTMRH0>
extern volatile __bit                   TU16BTMRH0          __at(0x1D78);	// @ (0x3AF * 8 + 0)
#define                                 TU16BTMRH0_bit      _BIT_ACCESS(TU16BTMRH,0)
// TU16BTMRH<TU16BTMRH1>
extern volatile __bit                   TU16BTMRH1          __at(0x1D79);	// @ (0x3AF * 8 + 1)
#define                                 TU16BTMRH1_bit      _BIT_ACCESS(TU16BTMRH,1)
// TU16BTMRH<TU16BTMRH2>
extern volatile __bit                   TU16BTMRH2          __at(0x1D7A);	// @ (0x3AF * 8 + 2)
#define                                 TU16BTMRH2_bit      _BIT_ACCESS(TU16BTMRH,2)
// TU16BTMRH<TU16BTMRH3>
extern volatile __bit                   TU16BTMRH3          __at(0x1D7B);	// @ (0x3AF * 8 + 3)
#define                                 TU16BTMRH3_bit      _BIT_ACCESS(TU16BTMRH,3)
// TU16BTMRH<TU16BTMRH4>
extern volatile __bit                   TU16BTMRH4          __at(0x1D7C);	// @ (0x3AF * 8 + 4)
#define                                 TU16BTMRH4_bit      _BIT_ACCESS(TU16BTMRH,4)
// TU16BTMRH<TU16BTMRH5>
extern volatile __bit                   TU16BTMRH5          __at(0x1D7D);	// @ (0x3AF * 8 + 5)
